Talk("玄燁!", 66, 1);
Talk("母后!真的是你，當我知道現在的太后是假的後，我以為你已經遭到不測，那可惡的神龍教妖女居然把母后你折磨成這樣．", 172, 0);
Talk("皇上，到底怎麼回事?小寶跟那個假太后呢?", 0, 0);
Talk("都虧小桂子機靈，拆穿了那個假太后，只可惜小桂子被那神龍教妖女抓走，少俠別擔心，我已派出施瑯大將軍圍剿神龍島，務必會救出小桂子．", 172, 0);
Talk("神龍島?看來有必要上這個島探個究竟<干，我的四十二章經>．", 0, 0);
ModifyEvent(-2, -2, -2, -2, 988, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(71, 19, 0, -2, -2, -2, -2, 2048, 2048, 2048, -2, -2, -2);
ModifyEvent(71, 20, 0, -2, -2, -2, -2, -1, -1, -1, -2, -2, -2);
ModifyEvent(71, 21, 0, -2, -2, -2, -2, 2052, 2052, 2052, -2, -2, -2);