Talk("鳳天南，你以為躲到沙漠我就找不到你了嗎？", 0, 0);
Talk("鐘阿四到底給了你什么，你竟然這樣苦苦相逼，你說，你要什么，我給你就是．", 4, 0);
Talk("你以為有錢就可以收買一切嗎？我告訴你，鐘阿四什么都沒給我，甚至連認識都不認識我．", 0, 0);
Talk("這位英雄，其實憑你的武功又何必為一個素不相識的人與我為敵呢．如果我們合作的話一定會成為天下最有錢的人．", 4, 0);
Talk("跟你這種人多說無意，受死吧！", 0, 0);
if TryBattle(3) == true then goto label0 end;
    Dead();
    exit();
::label0::
    LightScene();
    Talk("我看你這次往哪跑？", 0, 0);
    Talk("住手，休傷鳳天南．", 73, 0);
    Talk("有沒有搞錯？你怎么又出現了．", 0, 0);
    Talk("鳳天南，你還不快跑．", 73, 0);
    Talk("多謝姑娘救命之恩．", 4, 0);
    Talk("．．．．．．", 73, 0);
    Talk("姑娘，鳳天南作惡多端．．", 0, 0);
    Talk("別多說了，我不會讓你傷害鳳天南的．", 73, 0);
    if TryBattle(4) == true then goto label1 end;
        Dead();
        exit();
::label1::
        ModifyEvent(-2, -2, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
        LightScene();
        Talk("又讓他跑了？氣死我了，為什么我每次跟那個姑娘動手都一點敵意也沒有，好像在跟朋友拆招玩一樣？鳳天南總有一天我會逮到你的！", 0, 0);
        ModifyEvent(3, 2, 1, 0, 105, 0, 0, 5168, 5168, 5168, 0, -2, -2);
exit();
