x[10] = 126;
::label50::
if x[10] > 144 then
Talk("東海疏狂猶目斷，西京留守未心開．去年奉敕三冬往，今夏齋書九月來．北地官榮何日罷，南山道隱幾時回．直須早作彭城??計，燕國家風自不隤．", 68, 0);
exit();
end;
x[1] = GetRole(0, x[10] / 2);
if x[1] == 30 then jump_flag = true; else jump_flag = false; end;
x[10] = x[10] + 2;
if jump_flag == false then goto label50 end;
x[10] = x[10] + 18;
if GetRole(0, x[10] / 2) < 600 then
Talk("記得要勤加練功．", 68, 0);
exit();
end;
Talk("你最近的功夫練的怎么樣了", 68, 0);
Talk("稟師父，多虧您及各位師兄對我的幫助，徒兒的功夫比剛來時提高了不少．", 0, 1);
Talk("你最近練功確實蠻努力，但是否是進步了，還要看你的實際功夫如何．明天就是我全真教一年一度的大較武功之日，你今日早些休息去吧", 68, 0);
Talk("是，師父．＜大較？是什么．．．＞", 0, 1);
ModifyEvent(-2, -2, -2, -2, 1107, -1, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 4, -2, -2, 1109, 0, 0, 0, 0, 0, 0, -2, -2);
