if HaveItemBool(76) == true then goto label0 end;
    Talk("看什么看，全真教可是你亂闖亂看的地方？", 142, 0);
    exit();
::label0::
    Talk("師兄你好．", 0, 1);
    if CheckRoleMorality(0, 0, 70) == true then goto label1 end;
        Talk("本身蠻好，你一來，就不好了．", 142, 0);
        Talk("師兄這話從何說起？", 0, 1);
        Talk("你管從何說起干什么？總之看到你我就頭痛，你快些離開這．", 142, 0);
        exit();
::label1::
        Talk("好，好．新來的師弟，你也好啊．", 142, 0);
        Talk("還未請教師兄是．．．", 0, 1);
        Talk("哈哈，原來你還不知道我是誰．我叫趙志敬，聽說過沒有？", 142, 0);
        Talk("久聞大名，今日得見，實是三生有幸．", 0, 1);
        Talk("你嘴蠻甜的．", 142, 0);
        Talk("師兄哪里話，以后還請師兄多多照顧．", 0, 1);
        Talk("好，好．以后有好事一定想著你．", 142, 0);
        Talk("那師弟現在這里謝過師兄了", 0, 1);
        ModifyEvent(-2, -2, -2, -2, 1113, -2, -2, -2, -2, -2, -2, -2, -2);
exit();
