Talk("嘻嘻！", 0, 0);
Talk("小子，你笑什么？", 87, 0);
Talk("各位就是跟屋里那位姑娘有過節的人嗎？", 0, 0);
Talk("哦，你原來是程靈素那個丫頭請來的救兵，難怪你從那個屋子里出來呢．", 87, 0);
Talk("其實大家有什么話應該坐下來談，何必弄得打來打去的呢．", 0, 0);
Talk("好，你讓她交出我們五毒教的鎮教之寶藥王神篇我們就放過她．", 87, 0);
Talk("藥王神篇？聽這名就是人家毒手藥王的，跟你們五毒教有什么關系．", 0, 0);
Talk("這個．．．少廢話，不交出來就送你去見閻王爺！", 87, 0);
if TryBattle(11) then goto label40 end;
Dead();
exit();
::label40::
ModifyEvent(-2, 2, 1, -2, 128, 0, 0, -2, -2, -2, 0, -2, -2);
ModifyEvent(-2, 5, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
ModifyEvent(-2, 6, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
LightScene();