Talk("狄云，我想問你一件事．", 0, 0);
Talk("什么事？", 37, 0);
Talk("狄云，你知不知道，你師父身上的連城訣是哪來的？", 0, 0);
Talk("連城決？記得那是在很多年前的事了，有一個老伯伯給了我師妹一本書，說我將來會有一場牢獄之災，到時會有一個人救我出獄，然后讓師妹把那本書交給那個人．我跟師妹都不識字，只記得那個老伯伯說這本書叫什么”連城訣”，跟著就把書交給師父保管，后來我跟師妹剪紙玩，就把書從師父那拿回來了，然后把剪好的圖夾在書里．沒想到我后來真的會有牢獄之災，你救我出來后我讓你去找那本書交給師妹就是想讓師妹把書再交給你啊．那本書你不是交到我師妹手了嗎，怎么我師父又會有一本？", 37, 0);
Talk("我明白了，你不識字，所以在你師父那拿回的那本書不是連城訣，而是唐詩選集，你師父認定連城訣里寶藏所藏位置一定在這兩本書的一本中，而那本唐詩選集他已經翻爛了還沒找到其中秘密，而令一本明明寫著連城決，那么寶藏位置一定在這本書里所以才不動聲色，即使唐詩選輯不見了，也沒花時間去找．", 0, 0);
Talk("我說怎么那本書的封皮上的字數好像不一樣呢．", 37, 0);
ModifyEvent(62, 10, 1, -2, 189, 0, 0, 5092, 5092, 5092, 0, -2, -2);
ModifyEvent(62, 11, 1, -2, 189, 0, 0, 5090, 5090, 5090, 0, -2, -2);
ModifyEvent(62, 12, 1, -2, 189, 0, 0, 5094, 5094, 5094, 0, -2, -2);