Talk("請問一下，你們鑣局不做生意了嗎？怎麼沒半個人影．小爺我有些珍貴的寶物還想找你們保呢！", 0, 1);
Talk("這位公子，非常抱歉，今天本鑣局不做生意．", 36, 0);
Talk("開了鑣局卻不做生意，你這”福威鑣局”的招牌是掛假的啊！叫你們總鑣頭出來．", 0, 1);
Talk("說不保鑣就不保鑣，你在這大呼小叫個什麼勁．", 36, 0);
if TryBattle(42) then goto label20 end;
Dead();
exit();
::label20::
LightScene();
Talk("我看福威鑣局的武功也稀松平常，鑣還是不要給你們保比較妥當．", 0, 1);
Talk("哼！要不是我福威鑣局被青城派的人大舉入侵，家父被抓，家母被殺，其他的鑣師死的死，逃的逃，否則．．．．．", 36, 0);
Talk("這麼慘？你們是走失了人家的鑣，還是怎麼樣得罪了青城派．", 0, 1);
Talk("聽我父親說，先祖林遠圖曾打敗過青城派掌門長青子，所以今天他們是來報復的．", 36, 0);
Talk("怎麼如此可惡，小爺我看不過去了．", 0, 1);
Talk("少俠武功高強，請少俠幫我救出家父，我林平之這輩子愿做牛做馬服侍你．", 36, 0);
Talk("說這麼多做什麼，我就幫你上青城派看看好了．", 0, 1);
ModifyEvent(-2, -2, -2, -2, 329, 0, 0, -2, -2, -2, -2, -2, -2);
ModifyEvent(36, 0, 1, -2, 328, 0, 0, -2, -2, -2, 0, -2, -2);
ModifyEvent(57, 1, -2, -2, -2, -1, -2, -2, -2, -2, -2, -2, -2);