if isUsingItem(194) then goto label0 end;
exit();
::label0::
Talk("我請你喝酒啊．", 0, 0);
AddItemWithoutHint(194, -1);
Talk("好！喝！哎？你．．．不是馬老四？", 93, 0);
Talk("朋友，你說的馬老四可是那個在一品堂看門的人啊？", 0, 0);
Talk("除了他還有誰叫馬老四？", 93, 0);
Talk("他總跟你一起喝酒嗎？怎么今天沒來陪你？", 0, 0);
Talk("誰他媽的知道．他從前能偷懶就偷懶，自從那天跟我喝完酒就專心的在那站崗，他媽的他想站一輩子！", 93, 0);
Talk("原來馬老四也喜歡喝酒．", 0, 0);
ModifyEvent(-2, -2, -2, -2, -2, 0, 0, -2, -2, -2, 0, -2, -2);
ModifyEvent(-2, 2, -2, -2, -2, 359, 0, -2, -2, -2, 0, -2, -2);
ModifyEvent(62, 13, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);