Talk("福康安！", 0, 0);
Talk("你認錯人了．", 123, 0);
Talk("你明明就是福康安，我哪里會認錯！你去死吧．", 0, 0);
if TryBattle(51) == false then goto label0 end;
::label0::
    LightScene();
    Talk("你不是福康安？＜福康安的武功怎會這么高的．＞", 0, 0);
    Talk("在下陳家洛．", 123, 0);
    Talk("你．．．你就是紅花會的大當家？", 0, 0);
    Talk("不錯，正是在下．", 123, 0);
    Talk("大當家怎會來到這的．", 0, 0);
    Talk("我見你也是性情中人．實不相瞞，我們紅花會的文四哥被西夏一品堂抓走了，我正想怎么能救出他呢．", 123, 0);
    Talk("怎么，紅花會跟一品堂有什么過節嗎？", 0, 0);
    Talk("只是一品堂想得到我手中的一樣東西，但這樣東西實非我所有，而是一位前輩讓我代為保管的．是以我無法用東西來交換四哥．", 123, 0);
    Talk("＜東西？前輩？代為保管？難道跟那幾本書有關？＞大當家不如這樣吧，讓我想想辦法看能不能幫上什么忙．", 0, 0);
    Talk("如此就有勞小兄弟了．", 123, 0);
    ModifyEvent(-2, -2, -2, -2, 354, 0, 0, -2, -2, -2, 0, -2, -2);
    ModifyEvent(9, 2, 1, -2, 356, 0, 0, -2, -2, -2, 0, -2, -2);
exit();
