Talk("這位少俠，遠道而來，不知有何貴事．", 112, 0);
Talk("＜哇！這馬子正點＞哦！沒什麼事，我等旅游各地，為的是找幾本書，路過這里，想進來碰碰運氣．不過剛剛進來時，好像聽他們在講，你們也在找書，叫什麼．．", 0, 1);
Talk("是我回族圣物可蘭經．此書是本族祖傳之物，得自回教圣地麥加，數十代都是由首領珍重保管，乃本族圣物．不料前些日子花鐵干趁我父親遠出之際，竟將經書搶了過去，說要獻給朝廷，以此為挾，控制我回人．因此我率領了本族勇士，想從花鐵干那兒將經書搶奪回來，但那家伙實在太厲害了三番兩次都被他打了回來．", 112, 0);
if InTeam(81) == false then goto label0 end;
    Talk("花師叔？他是江湖上有名的大俠，他不會干那種事情的", 106, 1);
    Talk("此事確定是花鐵干做的嗎？", 0, 1);
    Talk("我族中有人認識花鐵干，確定肯定是他！", 112, 0);
::label0::
    Talk("是嗎？此事包在我身上．我替姑娘將那可蘭經要回來．", 0, 1);
    Talk("少俠若肯幫忙，我霍青桐代全族人向少俠謝謝．但還請少俠小心，花鐵干功夫厲害的緊．", 112, 0);
    Talk("＜為你赴湯蹈火在所不惜＞我會小心的．", 0, 1);
    ModifyEvent(-2, -2, 1, -2, 364, 365, 0, -2, -2, -2, 0, -2, -2);
    ModifyEvent(8, 5, 1, -2, 372, 0, 0, 5888, 5888, 5888, 0, -2, -2);
exit();
