if isUsingItem(174) then goto label0 end;
exit();
::label0::
if CheckEnoughMoney(2000) then goto label5 end;
Talk("聽故事二千兩．", 225, 0);
exit();
::label5::
AddItemWithoutHint(174, -2000);
Talk("說吧，我聽聽你的故事怎么樣．", 0, 0);
Talk("話說有一位俠客，我不知這位俠客的姓名，只是見他少了一條右臂，他騎一匹馬，牽一匹馬，另外那匹馬上帶著一頭模樣稀奇古怪的大鳥這便是江湖上赫赫有名的”神雕俠”！這位大俠行俠仗義，好打抱不平，可是從來不肯說自己姓名，江湖上朋友見他和一頭怪鳥形影不離便送了一個外號，叫作”神雕大俠”．他說”大俠”兩字決不敢當，旁人只好叫他作”神雕俠”，其實憑他的所作所為，稱一聲”大俠”又有甚么當不起呢？他要是當不起，誰還當得起？", 225, 0);
Talk("帶了只鳥到處走？難怪誰都怕他呢，誰不怕得禽流感啊再說這年頭自稱大俠的太多了吧．", 0, 0);
Talk("這神雕俠為了救愛國將領王惟忠之命，從江西趕到臨安四日四夜，目不交睫，沒睡上半個時辰．他和王將軍素不相識，只是憐他盡忠報國卻被奸臣陷害，便這等奮不顧身的干冒大險，為王將軍伸冤存孤，你說該不該稱他一聲大俠呢？", 225, 0);
Talk("這位英雄如此作為，那也當得起稱一聲”大俠”了．", 124, 0);
Talk("小姑娘說得沒錯．這神雕俠不但救了王將軍，還連夜殺了陷害王將軍的丁大全．聽說這神雕俠有一位妻子在大海彼岸，這些年來，神雕俠的妻子不在他身邊，有多少美貌女子對神雕俠獻好，神雕俠連正眼都不看她們一眼只是想著自己的妻子．", 225, 0);
Talk("真想有機會見見這位神雕俠．", 124, 0);
Talk("＜什么時候多出一個小女孩還沒見到神雕俠就成了他的ＦＡＮＳ，看來有機會我也得會會這位神雕俠，說不定跟天書中的”神”字有關呢＞", 0, 0);
Talk("聽說神雕俠現在在雁門關，你可以去看看啊．我的故事講完了．我們有機會再見！", 225, 0);
DarkScene();
ModifyEvent(-2, -2, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
ModifyEvent(6, 1, 1, -2, 375, 0, 0, 8206, 8206, 8206, 0, -2, -2);
ModifyEvent(-2, 3, 1, -2, 632, 0, 0, 6296, 6296, 6296, 0, -2, -2);
LightScene();
Talk("混蛋！回來！就講幾句話就要了我二千兩？對了，那個小姑娘也聽了，我得向她要一半錢．咦？那個小姑娘呢？不會吧？這么快人都走了，這下賠大發了！", 0, 0);