Talk("喂，小子，你竟然能闖進我的黑龍潭？", 66, 0);
if InTeam(98) == true then goto label0 end;
    Talk("前輩的黑龍潭確是難走，好在在下運氣好，竟誤打誤撞的進來了．", 0, 0);
    Talk("誤打誤撞？看來我的黑龍潭跟桃花島的機關確實還差著十萬八千里啊．哎！", 66, 0);
    exit();
::label0::
    Talk("這有什么難的？我剛出生就會擺這樣的陣法了．", 124, 0);
    Talk("什么？你剛出生就會？那你留下來教我好不好？", 66, 0);
    Talk("本姑娘沒這個心情．", 124, 0);
    Talk("看來我只有動手了．", 66, 0);
    Talk("好，如果你能贏我，我就留下來．", 124, 0);
    if TryBattle(55) == true then goto label1 end;
        LightScene();
        Talk("你輸了，還不留下來？", 66, 0);
        Talk("．．．本姑娘說話算話．大哥，我留下來教老婆婆陣法，不能跟你走了．", 124, 0);
        LeaveTeam(98);
        DarkScene();
        ModifyEvent(-2, -2, 1, -2, 381, 0, 0, -2, -2, -2, 0, -2, -2);
        ModifyEvent(-2, 2, 1, -2, 381, 0, 0, 6296, 6296, 6296, 0, -2, -2);
        LightScene();
        exit();
::label1::
        LightScene();
        Talk("我．．．我連一個小姑娘都打不過，怎么報仇啊．．．", 66, 0);
        ModifyEvent(-2, -2, 1, -2, 382, 0, 0, -2, -2, -2, 0, -2, -2);
exit();
