Talk("我躲在這都能被你發現！沒辦法，只有殺你滅口了．", 127, 0);
if TryBattle(59) then goto label5 end;
Dead();
exit();
::label5::
LightScene();
Talk("不要殺我啊．", 127, 0);
Talk("你到底是誰？", 0, 1);
Talk("我是長樂幫幫主石破天．", 127, 0);
Talk("什么？你是一幫之主？完了看來那個幫派不會有什么發展了．", 0, 1);
Talk("不信算了．", 127, 0);
if CheckRoleMorality(0, 40, 100) then goto label41 end;
Talk("你既然是幫主，那我就不會這么輕易放過你了．", 0, 1);
Talk("那要怎樣？", 127, 0);
Talk("想要我放過你，怎么著也得留下個三千五千兩的再說啊", 0, 1);
Talk("不會吧？你比我還黑？", 127, 0);
Talk("怎么樣？快拿出來啊．", 0, 1);
Talk("可是我真的沒有那么多錢啊", 127, 0);
Talk("那你有沒有什么值錢的東西啊？", 0, 1);
Talk("我身上只有一本劍譜．", 127, 0);
AddItem(90, 1);
Talk("算了，誰叫我今天心情好，放過你．", 0, 1);
::label41::
ModifyEvent(-2, -2, 1, -2, 407, 0, 0, -2, -2, -2, 0, -2, -2);
SetSubMapLayerData(30, 1, 23, 27, 0);