Talk("＜這就是摩天崖？真高啊．不知道跟臺灣的一零一大樓哪個更高些呢？＞謝煙客！你出來！老子特地來跟你比武來了．", 0, 0);
Talk("哪個不知道天高地厚的小子敢在我門口亂叫？", 128, 0);
if TryBattle(60) == false then goto label10 end;
::label10::
LightScene();
Talk("＜估計應該救出石破天了吧＞謝煙客，老子今天累了，有種你不要追，等哪天老子來找你．", 0, 0);
Talk("混蛋小子，別想跑！", 128, 0);
ModifyEvent(-2, -2, 0, -2, 0, 0, 413, 0, 0, 0, 0, -2, -2);
Add3EventNum(30, 1, 0, 0, 1);
ModifyEvent(30, 0, 1, -2, 417, 0, 0, 5904, 5904, 5904, 0, -2, -2);
ModifyEvent(30, 2, 1, -2, 418, 0, 0, 5152, 5152, 5152, 0, -2, -2);
WalkFromTo(54, 36, 56, 36);