Talk("姑娘，你怎么在這呆著？", 0, 0);
Talk("我被一個壞人逼得跳崖，幸好掛在樹枝上，沒死．便想找到路回家，但怎么走都好像不對．", 144, 0);
Talk("哇哩咧．你跳崖都死不了真是福大命大．．．等等．．．好像．．．對了，你是不是叫白繡啊？", 0, 0);
Talk("你怎么知道？", 144, 0);
Talk("是這樣的．你奶奶在大理找你找的很著急，這樣，我帶你出去，你快去找奶奶吧．", 0, 0);
if CheckRoleMorality(0, 50, 100) == true then goto label0 end;
    Talk("不用了，我試著自己出去就行了．", 144, 0);
    exit();
::label0::
    Talk("真的？那有勞公子．", 144, 0);
    DarkScene();
    ModifyEvent(-2, -2, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    ModifyEvent(16, 6, 1, -2, 434, 0, 0, -2, -2, -2, 0, -2, -2);
    ModifyEvent(16, 7, 1, -2, 435, 0, 0, 6120, 6120, 6120, 0, -2, -2);
    LightScene();
    OldSetScenePosition(27, 40);
    Talk("你奶奶就在大理，快去找她吧．", 0, 0);
    Talk("多謝公子搭救．", 144, 1);
exit();
