ModifyEvent(-2, -2, -2, -2, 0, 0, 0, 3492, 3492, 3492, 0, -2, -2);
ModifyEvent(-2, 2, -2, -2, 458, 0, 0, -2, -2, -2, 0, -2, -2);
ModifyEvent(-2, 3, -2, -2, 459, 0, 0, -2, -2, -2, 0, -2, -2);
DarkScene();
LightScene();
Talk("趙客縵胡纓，吳鉤霜雪明．銀鞍照白馬，瘋沓如流星．", 0, 0);
Talk("十步殺一人，千里不留行．事了拂衣去，深藏身與名．", 0, 0);
Talk("閑過信陵飲，脫劍膝前橫．將炙啖朱亥，持觴勸侯嬴．", 0, 0);
Talk("三杯吐然諾，五岳倒為輕．眼花耳熱后，意氣素霓生．", 0, 0);
Talk("救趙揮金錘，邯鄲先震驚．千秋二壯士，烜赫大梁城．", 0, 0);
Talk("縱死俠骨香，不慚世上英．誰能書閣下，白首太玄經？", 0, 0);
if HaveItemBool(167) == false then goto label77 end;
Talk("大哥，我跟著字的圖畫運功感覺身體好熱啊．", 38, 0);
::label77::
Talk("我明白了，其實書中并沒有記載武功，只是這些石壁上刻的字的形狀才是武功．難怪島主研究”俠客行”一書這么多年都沒有成功．", 0, 0);
DarkScene();
LightScene();
if HaveItemBool(167) == false then goto label96 end;
Talk("石破天領悟”太玄經”", 0, 0);
ModifyEvent(39, 13, 1, -2, 460, 0, 0, -2, -2, -2, 0, -2, -2);
exit();
::label96::
Talk("恭喜，你領悟了”太玄經”", 0, 0);
OldLearnMagic(0, 69, 0);