if HaveItemBool(167) == false then goto label0 end;
Talk("大哥，我感覺這一句跟上一句的圖畫好像對不上．", 38, 0);
Talk("不是圖畫，這是字．要意思對上才行．你以后有時間好好讀讀書吧", 0, 0);
Talk("大哥教訓得是．小弟以后是應該讀書習字．", 38, 0);
Talk("不過話又說回來了．好好看看，這塊石壁確實跟上一塊的意思承接不上．", 0, 0);
exit();
::label0::
ModifyEvent(-2, 22, -2, -2, 451, 0, 0, 3490, 3490, 3490, 0, -2, -2);
ModifyEvent(-2, 23, -2, -2, 452, 0, 0, 3490, 3490, 3490, 0, -2, -2);
ModifyEvent(-2, 24, -2, -2, 452, 0, 0, 3490, 3490, 3490, 0, -2, -2);
ModifyEvent(-2, 25, -2, -2, 452, 0, 0, 3490, 3490, 3490, 0, -2, -2);
ModifyEvent(-2, 26, -2, -2, 452, 0, 0, 3490, 3490, 3490, 0, -2, -2);
ModifyEvent(-2, 27, -2, -2, 452, 0, 0, 3490, 3490, 3490, 0, -2, -2);