Talk("大哥，俠客島一別數日，近來可好？", 38, 0);
Talk("恭喜兄弟得到絕世奇功．", 0, 0);
Talk("其實我習得神功也多虧大哥要不是大哥那日把我錯認，也就不會有今天的我．", 38, 0);
Talk("其實也不能這么說．都是兄弟你為人敦厚，要不是你搶了白掌門的令牌也不會去俠客島．是你的好心得到了好報而已．", 0, 0);
if InTeam(119) == false then goto label20 end;
Talk("兩個大男人在這互相夸獎也不嫌害臊．", 144, 0);
Talk("哈哈．白姑娘說的對．我也感覺不好意思了．", 0, 0);
Talk("對了大哥，自從上次你說我應該學學寫字之后，我真的有學．你看，這本就是我學會寫字之后寫的書．送給你當是感謝大哥的禮物．", 38, 0);
AddItem(114, 1);
Talk("不會吧？你也太牛Ｘ了，剛學寫字就出書．還是這種現今最流行的武功秘笈．少年人，有潛力！", 0, 0);
Talk("多謝大哥夸獎．", 38, 0);
ModifyEvent(-2, -2, 1, -2, 461, 0, 0, -2, -2, -2, 0, -2, -2);
::label20::