Talk("鏢銀三千兩送到京城，運達后一成傭金！", 78, 0);
Talk("是否接鏢？", 0, 3);
if AskRest() == true then goto  label0 end;
    exit();
::label0::
    AddItem(174, 3000);
    Talk("祝你一路順風！", 78, 0);
    ModifyEvent(-2, 30, -2, -2, 553, 0, 0, -2, -2, -2, 0, -2, -2);
    ModifyEvent(-2, 31, -2, -2, 553, 0, 0, -2, -2, -2, 0, -2, -2);
    ModifyEvent(-2, 32, -2, -2, 553, 0, 0, -2, -2, -2, 0, -2, -2);
    ModifyEvent(-2, 33, -2, -2, 553, 0, 0, -2, -2, -2, 0, -2, -2);
    ModifyEvent(3, 30, 0, -2, 0, 0, 556, 0, 0, 0, 0, -2, -2);
exit();
