Talk("阿彌陀佛", 67, 1);
if HaveItemBool(121) == false then goto label0 end;
    Talk("阿彌陀佛", 0, 1);
    Talk("聞如是：一時，佛游維耶離奈女樹國，與大比丘眾俱，比丘千二百五十，諸菩薩無央數．爾時有長者子，名曰善作，從城中出，詣奈女園，到世尊所，稽首足下，右三匝，卻住一面，叉手白佛：「欲有所問，大圣見聽，乃敢自陳．佛告善作：「恣所欲問，如來當具分別解說．」善作見聽，便白佛言：「唯天中天，寧有諸佛修行本愿自致正覺，今現世講說經道？大圣愿宣諸佛之名，聞之執持，戴著頂上，恣受所說，稽首歸命，頒宣功勛，無復眾難，不趣三涂，聞諸佛名，人若非人不得其便，若在縣官，說諸佛名，無能橫枉奪其所有，而性堅強，不懷怯弱，安隱得勝，又入戰斗，刀不傷身，箭射不入，閱叉諸鬼天龍神無敢嬈者，師子虎狼野獸弊蟲無能害者．」佛告善作：「諦聽！善思念之，當為汝說，擁護除難，無恐獲安．」於是善作受教而聽．佛言：「東方去此有佛號奉至誠如來至真等正覺，今現在說經法，世界曰名聞跡．復次，東方有佛號固進度思吉義如來至真等正覺，今現在說經法，世界曰莫能當．復次，東方去此佛土有佛號觀明功勛如來至真等正覺，今現在說經法，世界曰吉安．復次，東方去此佛土有佛號慈英寂首如來至真等正覺，今現在說經法，世界曰無恚恨．復次，東方去此佛土有佛號真性上首如來至真等正覺，今現在說經法，世界曰去杖．復次，東方去此佛土有佛號念眾生稱上首如來至真等正覺，今現在說經法，世界曰熾盛首．復次，東方去此佛土有佛號踴首高超須彌如來至真等正覺，今現在說經法，世界曰曜赫熱首．復次，東方去此佛土有佛號勝恥稱上首如來至真等正覺，今現在說經法，世界曰愛樂．假使有人遙聞東方諸如來號，受此諸佛世尊之名，諦奉善思抱在心懷，持諷誦讀，縱使諸佛戒德智慧道本平等；又諸剎土莊嚴清凈殊異之德，卓然無侶，無有塵垢，無有女人污穢之難，亦無五濁勤苦之患，三涂之厄，無沙礫石荊棘溝坑．」佛言：「善作！若有能持奉持是諸佛世尊之名，頒宣遠近，上夜覺寤而起經行，嘆詠誦說此諸佛名，中夜後夜起一心住，舍此無益，念所增修，如是行者，德行日進，終無損耗也．」佛告善作：「汝當樂此八佛名經，佛以斯法教族姓子，懷抱在心勿得忘舍，尋時精修便當逮見八千諸佛．善作於是聞圣教詔，則以寶華價值八千兩金，供散世尊，稽首佛足，右三匝，卻行而坐。時天帝釋在於彼會，前白佛言：「唯然大圣，我已受此八佛之名，以諷誦讀抱在心懷，唯天中天，吾身當勤精進奉行是八部場諸佛尊名，思惟專念不離食息，貴重恭敬為無上寶．佛告天帝：「以是之故，天阿須倫共戰斗時，若有恐懼拘翼，當念可無所畏，所以者何？假使有人贊嘆稱譽諸如來名八部經典，則為頒告無所畏業；宣諸如來經典名者，不遇惱熱眾患之難；若能顯傳諸如來名經典之要，則宣太平豐熟之世；能傳諸佛經典名者，則宣安隱除去大患；能傳諸佛經典名者，則為宣布寂然燕坐；若傳諸佛經典名者；則離一切無數恐懼；若能傳此諸佛名經，夢安覺歡，不畏縣官，水火盜賊怨家債主自然避去，鬼神羅剎妖魅魍魎，薜荔厭鬼皆不敢當，若入山陵溪谷壙路，抄賊劫掠自然不現，師子虎狼熊罷蛇虺悉自縮藏，所以者何，諸佛至尊德過須彌，智超江海，慧　虛空，獨步三界無能及者，十方一切莫不蒙度．佛說如是，長者善作及天帝釋諸比丘僧一切會者，諸天龍神阿須倫世間人聞經歡喜，作禮而退．回向文愿以此功德莊嚴佛凈土上報四重恩下濟三涂苦普愿盡法界沈溺諸有情悉發菩提心盡此一報身同生極樂國", 67, 1);
    Talk("阿彌陀佛", 0, 1);
    AddMorality(1);
::label0::
exit();
