CheckSubMapPic(32, 25, 6086, 22, 0);
    Talk("你別過來，我曾柔可不是好惹的！", 162, 0);
    Talk("你就是曾柔是吧？我是小寶的大哥，小寶很想你，不如跟我回去吧？", 0, 1);
    Talk("我不會回去的，你死了這條心吧！算你已經是第十個說是小寶大哥的人了！", 162, 0);
    Talk("＜完全沒辦法勾通，看來得想點辦法才行！＞", 0, 1);
    exit();
::label0::
    Talk("你別過來，我曾柔可不是好惹的！", 162, 0);
    Talk("你就是曾柔是吧？我是小寶的大哥，小寶很想你，不如跟我回去吧？", 0, 1);
    Talk("我不會回去的，你死了這條心吧！算你已經是第十個說是小寶大哥的人了！", 162, 0);
    Talk("雙兒也跟你一起出來了對不對？", 0, 1);
    Talk("你怎么知道？", 162, 0);
    Talk("我當然知道．我還知道你跟雙兒約好，只要她回去你就回去，那，現在雙兒已經回去了！", 0, 0);
    Talk("你說她回去就回去了？我怎么信你？", 162, 0);
    Talk("你想想，如果雙兒沒回去我怎么知道她跟你的約定？", 0, 1);
    Talk("這到也是，好吧，那我回去了！", 162, 0);
    DarkScene();
    ModifyEvent(-2, -2, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    Add3EventNum(32, 21, 1, 0, 3)
    ModifyEvent(32, 26, 1, -2, 673, 0, 0, 8574, 8574, 8574, 0, -2, -2);
    LightScene();
exit();
