PlayAnimation(-1, 6890, 6920);
Talk("怎么一覺醒來睡在地上了？", 0, 1);
PlayAnimation(-1, 6920, 7000);
Talk("這到底是哪？", 0, 1);
SetTowards(3);
Talk("！！！", 0, 0);
SetTowards(0);
Talk("！！！", 0, 0);
SetTowards(2);
Talk("！！！", 0, 1);
Talk("歡迎你來到這個世界，在開始前，請允許我問你幾個小問題．", 189, 0);
x[701] = 10;
x[702] = 10;
x[703] = 10;
x[704] = 10;
x[705] = 10;
x[706] = 10;
x[707] = 10;
x[708] = 10;
x[709] = 10;
x[710] = 10;
x[711] = 10;
x[712] = 10;
x[713] = 10;
x[714] = 10;
x[715] = 10;
x[1000] = 0;
::label218::
x[1001] = x[1000] * 100;
x[1001] = x[1001] + 2000;
x[1100 + x[1000]] = x[1001];
x[1000] = x[1000] + 1;
if x[1000] < 4 then goto label218 end;
::label339::
x[400] = "你為什么會選擇進入這個世界？";
DrawRect(15, 60, 285, 25);
DrawString(x[400], 20, 65, 26211);
x[1] = 7237;
::label311::
x[1005] = x[1002] * 100;
x[1005] = x[1005] + 2000;
x[x[1005]] = GetTalk(x[1]);
x[1] = x[1] + 1;
x[1002] = x[1002] + 1;
if x[1002] < 4 then goto label311 end;
DrawRect(80, 95, 150, 83);
strs = {};
for i=1, 4 do
strs[i] = x[x[1100 + i - 1]];
end
x[100] = menu(85, 100, strs, #strs);
if x[100] == 0 then goto label339 end;
if x[100] == 1 then
x[703] = x[703] + 1;
end;
if x[100] == 2 then
x[715] = x[715] + 1;
end;
if x[100] == 3 then
x[714] = x[714] + 1;
end;
if x[100] == 4 then
x[711] = x[711] + 1;
end;
x[1000] = 0;
::label471::
x[1001] = x[1000] * 100;
x[1001] = x[1001] + 2000;
x[1100 + x[1000]] = x[1001];
x[1000] = x[1000] + 1;
if x[1000] < 4 then goto label471 end;
::label600::
x[400] = "你認為什么才是真正的俠？";
DrawRect(15, 60, 285, 25);
DrawString(x[400], 20, 65, 26211);
x[1002] = 0;
x[1] = 7242;
::label572::
x[1005] = x[1002] * 100;
x[1005] = x[1005] + 2000;
x[x[1005]] = GetTalk(x[1]);
x[1] = x[1] + 1;
x[1002] = x[1002] + 1;
if x[1002] < 4 then goto label572 end;
DrawRect(80, 95, 200, 83);
strs = {};
for i=1, 4 do
strs[i] = x[x[1100 + i - 1]];
end
x[100] = menu(85, 100, strs, #strs);
if x[100] == 0 then goto label600 end;
if x[100] == 1 then
x[703] = x[703] + 1;
end;
if x[100] == 2 then
x[714] = x[714] + 2;
x[715] = x[715] - 1;
end;
if x[100] == 3 then
x[701] = x[701] - 2;
x[714] = x[714] + 3;
end;
if x[100] == 4 then
x[701] = x[701] + 2;
x[714] = x[714] - 1;
end;
x[1000] = 0;
::label756::
x[1001] = x[1000] * 100;
x[1001] = x[1001] + 2000;
x[1100 + x[1000]] = x[1001];
x[1000] = x[1000] + 1;
if x[1000] < 4 then goto label756 end;
::label885::
x[400] = "你認為什么才是真正的強大？";
DrawRect(15, 60, 285, 25);
DrawString(x[400], 20, 65, 26211);
x[1002] = 0;
x[1] = 7247;
::label857::
x[1005] = x[1002] * 100;
x[1005] = x[1005] + 2000;
x[x[1005]] = GetTalk(x[1]);
x[1] = x[1] + 1;
x[1002] = x[1002] + 1;
if x[1002] < 4 then goto label857 end;
DrawRect(80, 95, 150, 83);
strs = {};
for i=1, 4 do
strs[i] = x[x[1100 + i - 1]];
end
x[100] = menu(85, 100, strs, #strs);
if x[100] == 0 then goto label885 end;
if x[100] == 1 then
x[701] = x[701] + 1;
end;
if x[100] == 2 then
x[701] = x[701] - 3;
x[709] = x[709] + 1;
x[710] = x[710] + 1;
x[711] = x[711] + 1;
x[712] = x[712] + 1;
end;
if x[100] == 3 then
x[705] = x[705] + 1;
x[706] = x[706] + 1;
x[715] = x[715] - 1;
end;
if x[100] == 4 then
x[707] = x[707] + 1;
x[708] = x[708] + 1;
x[714] = x[714] - 1;
end;
x[1000] = 0;
::label1081::
x[1001] = x[1000] * 100;
x[1001] = x[1001] + 2000;
x[1100 + x[1000]] = x[1001];
x[1000] = x[1000] + 1;
if x[1000] < 4 then goto label1081 end;
::label1210::
x[400] = "你認為什么才是制勝的關鍵？";
DrawRect(15, 60, 285, 25);
DrawString(x[400], 20, 65, 26211);
x[1002] = 0;
x[1] = 7252;
::label1182::
x[1005] = x[1002] * 100;
x[1005] = x[1005] + 2000;
x[x[1005]] = GetTalk(x[1]);
x[1] = x[1] + 1;
x[1002] = x[1002] + 1;
if x[1002] < 4 then goto label1182 end;
DrawRect(80, 95, 150, 83);
strs = {};
for i=1, 4 do
strs[i] = x[x[1100 + i - 1]];
end
x[100] = menu(85, 100, strs, #strs);
if x[100] == 0 then goto label1210 end;
if x[100] == 1 then
x[701] = x[701] + 1;
x[702] = x[702] + 1;
x[703] = x[703] + 1;
x[705] = x[705] + 1;
x[715] = x[715] - 3;
end;
if x[100] == 2 then
x[705] = x[705] - 1;
x[706] = x[706] + 1;
x[715] = x[715] + 1;
end;
if x[100] == 3 then
x[704] = x[704] + 1;
end;
if x[100] == 4 then
x[701] = x[701] - 1;
x[707] = x[707] + 2;
x[712] = x[712] + 1;
x[713] = x[713] + 1;
x[714] = x[714] - 2;
end;
x[1002] = 0;
x[1000] = 0;
::label1430::
x[1001] = x[1000] * 100;
x[1001] = x[1001] + 2000;
x[1100 + x[1000]] = x[1001];
x[1000] = x[1000] + 1;
if x[1000] < 4 then goto label1430 end;
::label1551::
x[400] = "你認為最強大的武器時什么？";
DrawRect(15, 60, 285, 25);
DrawString(x[400], 20, 65, 26211);
x[1] = 7257;
::label1523::
x[1005] = x[1002] * 100;
x[1005] = x[1005] + 2000;
x[x[1005]] = GetTalk(x[1]);
x[1] = x[1] + 1;
x[1002] = x[1002] + 1;
if x[1002] < 4 then goto label1523 end;
DrawRect(80, 95, 150, 83);
strs = {};
for i=1, 4 do
strs[i] = x[x[1100 + i - 1]];
end
x[100] = menu(85, 100, strs, #strs);
if x[100] == 0 then goto label1551 end;
if x[100] == 1 then
x[704] = x[704] + 1;
x[705] = x[705] - 1;
x[710] = x[710] + 1;
end;
if x[100] == 2 then
x[704] = x[704] - 1;
x[705] = x[705] + 1;
x[711] = x[711] + 1;
end;
if x[100] == 3 then
x[701] = x[701] - 1;
x[707] = x[707] + 1;
x[713] = x[713] + 1;
end;
if x[100] == 4 then
x[702] = x[702] + 1;
x[703] = x[703] - 1;
x[709] = x[709] + 1;
end;
x[1002] = 0;
x[1000] = 0;
::label1755::
x[1001] = x[1000] * 100;
x[1001] = x[1001] + 2000;
x[1100 + x[1000]] = x[1001];
x[1000] = x[1000] + 1;
if x[1000] < 4 then goto label1755 end;
::label1876::
x[400] = "當一個弱隊友受傷時你會怎樣做？";
DrawRect(15, 60, 285, 25);
DrawString(x[400], 20, 65, 26211);
x[1] = 7262;
::label1848::
x[1005] = x[1002] * 100;
x[1005] = x[1005] + 2000;
x[x[1005]] = GetTalk(x[1]);
x[1] = x[1] + 1;
x[1002] = x[1002] + 1;
if x[1002] < 4 then goto label1848 end;
DrawRect(80, 95, 150, 83);
strs = {};
for i=1, 4 do
strs[i] = x[x[1100 + i - 1]];
end
x[100] = menu(85, 100, strs, #strs);
if x[100] == 0 then goto label1876 end;
if x[100] == 1 then
x[706] = x[706] + 2;
x[714] = x[714] + 2;
x[715] = x[715] - 3;
end;
if x[100] == 2 then
x[714] = x[714] + 1;
end;
if x[100] == 3 then
x[714] = x[714] - 1;
x[704] = x[704] + 1;
end;
if x[100] == 4 then
x[707] = x[707] + 2;
x[714] = x[714] - 2;
x[715] = x[715] + 1;
end;
x[1002] = 0;
x[1000] = 0;
::label2056::
x[1001] = x[1000] * 100;
x[1001] = x[1001] + 2000;
x[1100 + x[1000]] = x[1001];
x[1000] = x[1000] + 1;
if x[1000] < 4 then goto label2056 end;
::label2177::
x[400] = "當一個強隊友受傷時你會怎樣做？";
DrawRect(15, 60, 285, 25);
DrawString(x[400], 20, 65, 26211);
x[1] = 7267;
::label2149::
x[1005] = x[1002] * 100;
x[1005] = x[1005] + 2000;
x[x[1005]] = GetTalk(x[1]);
x[1] = x[1] + 1;
x[1002] = x[1002] + 1;
if x[1002] < 4 then goto label2149 end;
DrawRect(80, 95, 150, 83);
strs = {};
for i=1, 4 do
strs[i] = x[x[1100 + i - 1]];
end
x[100] = menu(85, 100, strs, #strs);
if x[100] == 0 then goto label2177 end;
if x[100] == 1 then
x[715] = x[715] + 1;
x[714] = x[714] + 1;
x[703] = x[703] - 1;
end;
if x[100] == 2 then
x[714] = x[714] + 1;
end;
if x[100] == 3 then
x[715] = x[715] - 1;
x[705] = x[705] + 2;
end;
if x[100] == 4 then
x[714] = x[714] - 2;
x[715] = x[715] - 2;
end;
x[1002] = 0;
x[1000] = 0;
::label2349::
x[1001] = x[1000] * 100;
x[1001] = x[1001] + 2000;
x[1100 + x[1000]] = x[1001];
x[1000] = x[1000] + 1;
if x[1000] < 4 then goto label2349 end;
::label2470::
x[400] = "下面的人物中你最喜歡誰？";
DrawRect(15, 60, 285, 25);
DrawString(x[400], 20, 65, 26211);
x[1] = 7272;
::label2442::
x[1005] = x[1002] * 100;
x[1005] = x[1005] + 2000;
x[x[1005]] = GetTalk(x[1]);
x[1] = x[1] + 1;
x[1002] = x[1002] + 1;
if x[1002] < 4 then goto label2442 end;
DrawRect(80, 95, 150, 83);
strs = {};
for i=1, 4 do
strs[i] = x[x[1100 + i - 1]];
end
x[100] = menu(85, 100, strs, #strs);
if x[100] == 0 then goto label2470 end;
if x[100] == 1 then
x[709] = x[709] + 2;
end;
if x[100] == 2 then
x[710] = x[710] + 2;
end;
if x[100] == 3 then
x[711] = x[711] + 2;
end;
if x[100] == 4 then
x[712] = x[712] + 2;
end;
x[1002] = 0;
x[1000] = 0;
::label2610::
x[1001] = x[1000] * 100;
x[1001] = x[1001] + 2000;
x[1100 + x[1000]] = x[1001];
x[1000] = x[1000] + 1;
if x[1000] < 4 then goto label2610 end;
::label2731::
x[400] = "下面的人物中你最喜歡誰？";
DrawRect(15, 60, 285, 25);
DrawString(x[400], 20, 65, 26211);
x[1] = 7277;
::label2703::
x[1005] = x[1002] * 100;
x[1005] = x[1005] + 2000;
x[x[1005]] = GetTalk(x[1]);
x[1] = x[1] + 1;
x[1002] = x[1002] + 1;
if x[1002] < 4 then goto label2703 end;
DrawRect(80, 95, 150, 83);
strs = {};
for i=1, 4 do
strs[i] = x[x[1100 + i - 1]];
end
x[100] = menu(85, 100, strs, #strs);
if x[100] == 0 then goto label2731 end;
if x[100] == 1 then
x[705] = x[705] + 2;
end;
if x[100] == 2 then
x[703] = x[703] + 2;
end;
if x[100] == 3 then
x[704] = x[704] + 2;
end;
if x[100] == 4 then
x[713] = x[713] + 2;
end;
x[1002] = 0;
x[1000] = 0;
::label2871::
x[1001] = x[1000] * 100;
x[1001] = x[1001] + 2000;
x[1100 + x[1000]] = x[1001];
x[1000] = x[1000] + 1;
if x[1000] < 4 then goto label2871 end;
::label2992::
x[400] = "下面的人物中你最喜歡誰？";
DrawRect(15, 60, 285, 25);
DrawString(x[400], 20, 65, 26211);
x[1] = 7282;
::label2964::
x[1005] = x[1002] * 100;
x[1005] = x[1005] + 2000;
x[x[1005]] = GetTalk(x[1]);
x[1] = x[1] + 1;
x[1002] = x[1002] + 1;
if x[1002] < 4 then goto label2964 end;
DrawRect(80, 95, 150, 83);
strs = {};
for i=1, 4 do
strs[i] = x[x[1100 + i - 1]];
end
x[100] = menu(85, 100, strs, #strs);
if x[100] == 0 then goto label2992 end;
if x[100] == 1 then
x[701] = x[701] + 2;
end;
if x[100] == 2 then
x[702] = x[702] + 2;
end;
if x[100] == 3 then
x[703] = x[703] + 2;
end;
if x[100] == 4 then
x[707] = x[707] + 2;
end;
x[801] = GetRole(0, 36 / 2);
x[802] = GetRole(0, 84 / 2);
x[803] = GetRole(0, 86 / 2);
x[804] = GetRole(0, 88 / 2);
x[805] = GetRole(0, 90 / 2);
x[806] = GetRole(0, 92 / 2);
x[807] = GetRole(0, 94 / 2);
x[808] = GetRole(0, 96 / 2);
x[809] = GetRole(0, 100 / 2);
x[810] = GetRole(0, 102 / 2);
x[811] = GetRole(0, 104 / 2);
x[812] = GetRole(0, 106 / 2);
x[813] = GetRole(0, 108 / 2);
x[814] = GetRole(0, 112 / 2);
x[815] = GetRole(0, 98 / 2);
x[701] = x[701] * x[801];
x[702] = x[702] * x[802];
x[703] = x[703] * x[803];
x[704] = x[704] * x[804];
x[705] = x[705] * x[805];
x[706] = x[706] * x[806];
x[707] = x[707] * x[807];
x[708] = x[708] * x[808];
x[709] = x[709] * x[809];
x[710] = x[710] * x[810];
x[711] = x[711] * x[811];
x[712] = x[712] * x[812];
x[713] = x[713] * x[813];
x[714] = x[714] * x[814];
x[715] = x[715] * x[815];
x[701] = x[701] / 10;
x[702] = x[702] / 10;
x[703] = x[703] / 10;
x[704] = x[704] / 10;
x[705] = x[705] / 10;
x[706] = x[706] / 10;
x[707] = x[707] / 10;
x[708] = x[708] / 10;
x[709] = x[709] / 10;
x[710] = x[710] / 10;
x[711] = x[711] / 10;
x[712] = x[712] / 10;
x[713] = x[713] / 10;
x[714] = x[714] / 10;
x[715] = x[715] / 10;
SetRole(0, 36 / 2, x[701]);
SetRole(0, 84 / 2, x[702]);
SetRole(0, 86 / 2, x[703]);
SetRole(0, 88 / 2, x[704]);
SetRole(0, 90 / 2, x[705]);
SetRole(0, 92 / 2, x[706]);
SetRole(0, 94 / 2, x[707]);
SetRole(0, 96 / 2, x[708]);
SetRole(0, 100 / 2, x[709]);
SetRole(0, 102 / 2, x[710]);
SetRole(0, 104 / 2, x[711]);
SetRole(0, 106 / 2, x[712]);
SetRole(0, 108 / 2, x[713]);
SetRole(0, 112 / 2, x[714]);
SetRole(0, 98 / 2, x[715]);
x[1002] = 0;
x[1000] = 0;
::label3615::
x[1001] = x[1000] * 100;
x[1001] = x[1001] + 2000;
x[1100 + x[1000]] = x[1001];
x[1000] = x[1000] + 1;
if x[1000] < 2 then goto label3615 end;
::label3736::
x[400] = "請選擇游戲難度";
DrawRect(15, 60, 285, 25);
DrawString(x[400], 20, 65, 26211);
x[1] = 7799;
::label3708::
x[1005] = x[1002] * 100;
x[1005] = x[1005] + 2000;
x[x[1005]] = GetTalk(x[1]);
x[1] = x[1] + 1;
x[1002] = x[1002] + 1;
if x[1002] < 2 then goto label3708 end;
DrawRect(80, 95, 150, 83);
strs = {};
for i=1, 2 do
strs[i] = x[x[1100 + i - 1]];
end
x[100] = menu(85, 100, strs, #strs);
if x[100] == 0 then goto label3736 end;
if x[100] == 1 then
x[1] = 1;
::label3784::
SetRole(x[1], 110 / 2, 0);
x[1] = x[1] + 1;
if x[1] <= 319 then goto label3784 end;
SetRole(323, 110 / 2, 0);
SetRole(324, 110 / 2, 0);
SetRole(76, 110 / 2, 95);
x[1] = 1;
::label3847::
SetItem(x[1], 128 / 2, 0);
x[1] = x[1] + 1;
if x[1] <= 248 then goto label3847 end;
end;
Talk("我的問題問完了，下面你可以開始你的游戲了，希望我們日后還能見面．", 189, 0);
Talk("喂！你還沒告訴我這是哪里呢！！", 0, 1);
x[1] = GetRole(0, 94 / 2);
SetRole(320, 38 / 2, x[1]);
SetRole(0, 94 / 2, 0);
