if InTeam(107) then goto label0 end;
Talk("一具尸體下還壓著一張羊皮這張羊皮上怎么一個字也沒有？哦，我知道了，一定是這個死者生前墊在屁股下防寒的！", 0, 1);
exit();
::label0::
Talk("骷髏下有張羊皮！", 0, 1);
Talk("恭喜公子，這是明教武功的無上心法所在的地圖！", 132, 1);
Talk("小昭說著將手指咬破，將鮮血涂在羊皮之上，慢慢便顯現了字跡，第一行是“明教圣火心法，乾坤大挪移”十一個字．", 0, 2);
Talk("只要再涂些就能見到心法所在地了！", 132, 1);
Talk("是否拿去乾坤大挪移？", 0, 3);
if AskRest() then goto  label36 end;
Talk("乾坤大挪移是明教的護教心法，我看我們還是不要動了", 0, 1);
AddMorality(1);
ModifyEvent(-2, -2, 1, -2, 0, 0, 0, -2, -2, -2, 0, -2, -2);
exit();
::label36::
AddMorality(-2);
Talk("好！我們一起用血涂！", 0, 1);
Talk("公子你看，出來了．”乾坤大挪移所在位置．．．”", 132, 1);
DarkScene();
OldSetScenePosition(39, 30);
LightScene();
Talk("這．．．這是哪里？", 0, 1);
Talk("公子，這上面說從有”倚”字的墻上順時針數，依次是：”乾””坤””坎””離””震””艮””巽””兌”", 132, 1);
Talk("好像是八卦啊！", 0, 1);
Talk("這上面說第一個提示是：天", 132, 1);
ModifyEvent(-2, -2, 1, -2, 0, 0, 0, -2, -2, -2, 0, -2, -2);