Talk("楊過，小龍女，聽說”神雕俠侶”這本書在你們手里，快交出來．", 0, 1);
Talk("你竟然敢到我古墓派來撒野打擾我跟龍兒的生活！你今天休想從這里出去！", 58, 0);
if TryBattle(57) == true then goto label0 end;
    Dead();
    exit();
::label0::
    LightScene();
    Talk("你的武功很厲害，我和過兒不是你的對手，這本書你拿去吧．", 59, 0);
    AddItem(153, 1);
    ModifyEvent(-2, 0, -2, -2, 760, 0, 0, -2, -2, -2, 0, -2, -2);
    ModifyEvent(-2, 1, -2, -2, 761, 0, 0, -2, -2, -2, 0, -2, -2);
    ModifyEvent(-2, 10, 1, -2, 0, 0, 0, 7690, 7690, 7690, 0, -2, -2);
    ModifyEvent(-2, 11, 1, -2, 762, 0, 0, 7748, 7748, 7748, 0, -2, -2);
    ModifyEvent(-2, 12, 1, -2, 762, 0, 0, 7748, 7748, 7748, 0, -2, -2);
    ModifyEvent(-2, 13, 1, -2, 0, 0, 0, 7806, 7806, 7806, 0, -2, -2);
    AddMorality(-5);
exit();
