Talk("想不到楊少俠竟然跟李莫愁走到了一起！", 62, 0);
Talk("金輪法王，你不要硬挺了，你中了我的冰破銀針，沒多少時辰好活了．", 126, 0);
Talk("法王，我來救你．", 0, 1);
Talk("想不到你也來了，上次在山洞中打傷我姑姑的你也有份吧，今天我就要為我姑姑報仇．", 58, 0);
if TryBattle(132) == true then goto label0 end;
    Dead();
    exit();
::label0::
    ModifyEvent(-2, 2, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    ModifyEvent(-2, 3, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    ModifyEvent(-2, 4, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    ModifyEvent(-2, 6, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    ModifyEvent(-2, 7, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    LightScene();
    AddMorality(-2);
exit();
