Talk("＜見這乞丐面色紅潤，中氣十足，好像是個內功高手．哦，他的右手食指斷了，難道是北丐洪七公？＞請問您可是洪七公前輩？", 0, 0);
Talk("叫我七公或者老乞丐就行了什么前輩不前輩的．", 69, 4);
Talk("＜原來他真是北丐．＞”Ｙ”老家伙，是你，我正想找你呢！”Ｎ”老前輩你好啊！", 0, 1);
if AskRest() == true then goto  label0 end;
    ModifyEvent(32, 32, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    ModifyEvent(32, 33, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    ModifyEvent(32, 34, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    ModifyEvent(18, 4, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    ModifyEvent(18, 5, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    ModifyEvent(18, 6, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    Add3EventNum(60, 23, 0, 0, 26)
    Add3EventNum(60, 24, 0, 0, 0)
    Talk("老前輩，你好啊．", 0, 0);
    Talk("你認識Ｆ４嗎？", 69, 4);
    Talk("Ｆ４？唱歌的？", 0, 0);
    Talk("什么唱歌的，是四個淫賊，自稱什么東淫西賤南蕩北娼", 69, 4);
    Talk("不認識．", 0, 0);
    Talk("我見你一人行走，還道是Ｆ４的同黨，既然不是，那便很好．", 69, 4);
    Talk("七公找他們有事嗎？", 0, 0);
    Talk("老乞丐在這里，兄弟們上啊", 29, 0);
    DarkScene();
    ModifyEvent(-2, 13, 1, -2, 0, 0, 0, 8580, 8580, 8580, 0, -2, -2);
    ModifyEvent(-2, 14, 1, -2, 0, 0, 0, 8586, 8586, 8586, 0, -2, -2);
    ModifyEvent(-2, 15, 1, -2, 0, 0, 0, 8588, 8588, 8588, 0, -2, -2);
    ModifyEvent(-2, 16, 1, -2, 0, 0, 0, 8590, 8590, 8590, 0, -2, -2);
    LightScene();
    Talk("東淫！", 29, 0);
    Talk("西賤！", 61, 1);
    Talk("南蕩！", 167, 4);
    Talk("北色！", 187, 5);
    Talk("小朋友，我來收拾這幾個，你躲遠點．", 69, 4);
    Talk("七公，我來幫你．", 0, 0);
    if TryBattle(134) == true then goto label1 end;
        Dead();
        exit();
::label1::
        ModifyEvent(-2, 13, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
        ModifyEvent(-2, 14, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
        ModifyEvent(-2, 15, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
        ModifyEvent(-2, 16, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
        LightScene();
        Talk("他們幾個逃跑的速度真快啊", 0, 0);
        Talk("他們都是江湖上有名的輕功高手，小朋友，不陪你聊了我還要去追他們．", 69, 4);
        DarkScene();
        ModifyEvent(-2, -2, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
        Add3EventNum(57, 18, 0, 0, 0)
        LightScene();
        AddMorality(5);
        AddItem(56, 1);
        Talk("七公，你的書忘了！咦？上面有字：送小友！啊，原來是七公故意留給我的．", 0, 0);
        exit();
::label0::
        Talk("老家伙，原來是你啊，我正想找你呢！", 0, 0);
        if TryBattle(133) == true then goto label2 end;
            Dead();
            exit();
::label2::
            ModifyEvent(-2, -2, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
            LightScene();
            AddMorality(-5);
exit();
