Talk("姑娘你好啊．怎么一個人在這呆著，是不是遇到什么難事了？", 0, 1);
Talk("我跟我表哥失散了．", 106, 0);
Talk("你表哥？", 0, 1);
Talk("我表哥叫汪嘯風．", 106, 0);
Talk("汪嘯風？沒聽過．", 0, 1);
Talk("你真是孤陋寡聞．我表哥和我合稱鈴劍雙俠．", 106, 0);
Talk("鈴劍雙俠？名字起得還不錯．", 0, 1);
if AskJoin () then goto label35 end;
Talk("不跟你說了，我還有事．", 0, 1);
exit();
::label35::
Talk("你要是信得過我，不如我帶你找你表哥去啊．", 0, 1);
if TeamIsFull() == false then goto label51 end;
Talk("我也希望你能幫我找到我表哥，可是你的隊伍滿了，我無法加入．", 106, 0);
exit();
::label51::
Talk("對啊，天下這么大我怎么找得到我表哥啊，要是有人能幫我那就太好了．", 106, 0);
DarkScene();
ModifyEvent(-2, -2, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
LightScene();
Join(81);
ModifyEvent(66, 5, 1, -2, 855, 0, 0, 5412, 5412, 5412, 0, -2, -2);