Talk("醫一人，殺一人殺一人，醫一人醫人殺人一樣多蝕本生意決不做", 28, 0);
if TeamIsFull() == false then goto label5 end;
exit();
::label5::
Talk("＜我要是用平大夫他老婆被強暴這事要挾他，讓他加入我的隊伍，那我以后就不怕刀傷劍傷了．＞", 0, 1);
if AskJoin () then goto label16 end;
Talk("＜算了，我這么做好像有點太缺德了．＞", 0, 1);
exit();
::label16::
Talk("平大夫，總一個人在這坐著多悶啊，不如陪我出去走走", 0, 1);
Talk("我是大夫，當然要坐堂，不好意思，不能當你的私人醫生．", 28, 0);
Talk("（小聲）你相不相信我把你老婆跟血刀老祖的事說出去", 0, 1);
Talk("你．．．", 28, 0);
Talk("（小聲）好，明天武林中就回有你殺人名醫的傳聞了．", 0, 1);
Talk("等等，加入就加入，我正想出去散散心．", 28, 0);
Talk("（小聲）這就對了．", 0, 1);
DarkScene();
ModifyEvent(-2, -2, -2, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
LightScene();
Join(28);
AddMorality(-4);