Talk("你是什么人，竟敢闖我的燕子塢．", 51, 0);
Talk("公子，是我們不小心讓他進來的．", 179, 0);
if TryBattle(163) then goto label10 end;
Dead();
exit();
::label10::
LightScene();
Talk("想不到這位少俠武功如此之高，就讓我慕容復來會會你", 51, 0);
if TryBattle(164) == false then goto label26 end;
::label26::
LightScene();
Talk("慕容公子果然名不虛傳．", 0, 1);
Talk("慕容復今日得見少俠十分榮幸，在下這就讓人準備一桌酒菜，請少俠同飲．", 51, 0);
Talk("那就恭敬不如從命了．", 0, 1);
DarkScene();
LightScene();
Talk("今日與少俠相識，實是慕容復的榮幸，不知少俠可知我慕容的身世？", 51, 0);
Talk("在下僅知姑蘇慕容向來精通各家武學，有”以彼之道，還施彼身”的作風．", 0, 1);
Talk("哈哈，看來少俠對我慕容氏還不是很了解啊．我慕容家乃大燕皇族，身負復國之重任．", 51, 0);
Talk("難怪慕容公子單名”復”字想不到慕容公子是皇族后裔失敬失敬．", 0, 1);
Talk("唉，但是可惜啊．", 51, 0);
Talk("不知慕容公子為何唉聲嘆氣", 0, 1);
Talk("想我堂堂七尺男兒，直到現在復國大計竟毫無頭緒．", 51, 0);
Talk("我還以為是什么，慕容公子要是有什么需要做的只要告訴小弟一聲，小弟一定盡力", 0, 1);
Talk("少俠果然是性情中人．", 51, 0);
ModifyEvent(-2, -2, -2, -2, 858, 0, 0, -2, -2, -2, 0, -2, -2);
SetSubMapLayerData(52, 1, 29, 47, 0);