if HaveItemBool(80) == false then goto label0 end;
    if InTeam(77) == false then goto label1 end;
        Talk("華山弟子勞德諾拜見五岳盟主左師伯．", 206, 1);
        Talk("你旁邊的就是岳掌門新收的徒弟？", 22, 0);
        Talk("拜見左師伯，晚輩就是師父新收的徒弟．", 0, 1);
        Talk("岳師兄新收徒弟都特意來跟我打聲招呼，不愧君子二字行為如此坦蕩．", 22, 0);
        Talk("師父說左師伯是五岳盟主，五岳各派有何大事，自然要向您稟報一聲．", 206, 1);
        Talk("哈哈哈．很好．天晚了，今天就住在嵩山派吧．", 22, 0);
        Talk("那就多謝左師伯了．", 206, 1);
        ModifyEvent(-2, -2, -2, -2, 988, -2, -2, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 14, 0, -2, 0, 0, 989, 0, 0, 0, 0, -2, -2);
        ModifyEvent(-2, 15, 0, -2, 0, 0, 989, 0, 0, 0, 0, -2, -2);
        exit();
::label0::
::label1::
        Talk("小子，你是混哪里的，敢來嵩山亂闖？", 22, 0);
exit();
