Talk("你這小子，挺有兩下子的，過的了我的萬鱷潭，很好．咦！我看你手長足長，腦骨後禿，腰脅柔軟，跟我非常像，真是學武的奇才．快磕頭，求我收你為弟子．", 44, 0);
Talk("有沒有搞錯，看你呆頭呆腦的，還要我拜你為師．我看你拜我為師還差不多．", 0, 1);
Talk("你這小子，上次仗著人多，占了我們四大惡人的便宜，這次咱倆單打獨斗．好，你若打的過我，我岳老二就拜你為師．否則，你就拜我為師．", 44, 0);
Talk("奇怪，我怎麼聽人家說南海鱷神叫”岳老三”呢？", 0, 1);
Talk("是”岳老二”！", 44, 0);
if TryBattle(90) == false then
Dead();
exit();
end;
LightScene();
Talk("你這小子，資質果真不錯，我沒看錯眼．來，快拜我岳老二為師．", 44, 0);
Talk("岳老三，你自己說過的話都忘了嗎？你說打輸我要拜我為師的，怎麼忘了呢？", 0, 1);
Talk("拜就拜，我岳老二向來說話算話．你是我師父了．", 44, 0);
Talk("徒兒，你就跟為師的走吧．", 0, 1);
ModifyEvent(104, 50, 1, 0, 958, 0, 0, 6414, 6414, 6414, -2, -2, -2);
if TeamIsFull() == false then
Talk("是．", 44, 0);
DarkScene();
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
LightScene();
Join(44);
exit();
end;
Talk("你的隊伍已滿，我就直接去小村吧。", 44, 0);
DarkScene();
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(70, 33, 1, 0, 129, 0, 0, 6414, 6414, 6414, -2, -2, -2);
LightScene();