Talk("靈姑娘用毒，醫術都極為高明，有你陪伴闖蕩江湖，旅程將會十分安穩，不知姑娘是否肯隨我們四處走走呢？", 0, 1);
if InTeam(1) then
Talk("是啊，姑娘一個人住這里，悶也悶慌了，就隨我們到處走走吧。", 1, 1);
Talk("看在胡公子的面子上，我就陪你們到處玩一玩。", 2, 0);
ModifyEvent(104, 41, 1, 0, 946, 0, 0, 7224, 7224, 7224, -2, -2, -2);
if TeamIsFull() == false then
Join(2);
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
exit();
end;
Talk("你的隊伍已滿，我就直接去小村吧。", 2, 0);
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(70, 6, 1, 0, 103, 0, 0, 5210, 5210, 5210, -2, -2, -2);
exit();
end;
Talk("你臭美啊！跟你在一起一定很無聊。", 2, 0);