Talk("小兄弟，再次造訪，不知有何見教？", 1, 0);
if AskJoin () then
ModifyEvent(3, 9, 1, 0, 636, 0, 0, -2, -2, -2, -2, -2, -2);
ModifyEvent(3, 12, 1, 0, 636, 0, 0, -2, -2, -2, -2, -2, -2);
ModifyEvent(3, 11, 1, 0, 636, 0, 0, -2, -2, -2, -2, -2, -2);
ModifyEvent(3, 10, 1, 0, 636, 0, 0, -2, -2, -2, -2, -2, -2);
Talk("我正在尋找一些書，要在江湖上到處走動，胡大哥如果不嫌棄，不妨與小弟同行，說不定可以得到你想要的消息。", 0, 1);
Talk("既然如此，恭敬不如從命。", 1, 0);
if TeamIsFull() then
Talk("你的隊伍已滿，我就直接去小村吧。", 1, 0);
ModifyEvent(0, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
ModifyEvent(70, 5, 1, 0, 101, 0, 0, 5166, 5166, 5166, -2, -2, -2);
exit();
end;
Join(1);
DarkScene();
ModifyEvent(0, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
LightScene();
exit();
end;
Talk("沒事，隨便逛逛。", 0, 1);