if InTeam(91) == false then
exit();
end;
Talk("這……這一定就是我爹的尸骨了……爹，我把娘的骨灰帶來了，娘說要和你合葬在一起，我這就幫你們完成心愿。", 91, 0);
Talk("姑娘請節哀，我來幫你。", 0, 1);
DarkScene();
OldSetScenePosition(22, 28);
SetTowards(0);
ModifyEvent(-2, 1, 1, 0, 319, 0, 0, 6700, 6700, 6700, -2, -2, -2);
ModifyEvent(-2, 9, 1, 0, 319, 0, 0, 6696, 6696, 6696, -2, -2, -2);
LightScene();
Talk("從墻上的字來看，這位金蛇郎君夏前輩真是一位了不起的高人啊。", 0, 1);
Talk("那是，我爹爹自然了不起。", 91, 0);
Talk("這就是金蛇劍吧，插的好深……", 0, 1);
Talk("對了，袁大哥提到過這把金蛇劍，你幫我把它拔下來，我們去還給袁大哥。", 91, 0);
ModifyEvent(-2, 0, 1, 0, 320, 0, 0, -2, -2, -2, -2, -2, -2);