if InTeam(9) == false then
exit();
end;
AddMorality(1);
Talk("太師父，太師父，無忌回來看你了。", 9, 1);
Talk("無忌，真的是你。好孩子，你沒有死，翠山可有後了。是蝶谷醫仙將你醫好的嗎？", 5, 0);
Talk("不是的。我是有了一番奇遇。。。。如此如此。。。。這般這般。。。後來修習了九陽神功，才將我身上的寒毒化去。", 9, 1);
Talk("很好，很好，真難為你了。現在你已經做了明教的教主，記得要約束教眾，不可為非作歹。記得常存俠義之心，才是我輩中人。", 5, 0);
Talk("太師父教誨，無忌謹記在心。。。。", 9, 1);
Talk("這是當年我傳授你爹的一套武功，如今就傳給你吧。", 5, 0);
AddItem(169, 1);
Talk("多謝太師父", 9, 0);
Talk("呵呵呵，翠山有后了，翠山有后了……", 5, 0);
ModifyEvent(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);