Talk("可惡的袁承志，居然用安小慧的發釵，不理他了，哼……我也找個人在一起，氣氣他……喂，小子！", 91, 0);
Talk("姑娘是在叫我么？", 0, 1);
Talk("當然是叫你！這還有別人么？", 91, 0);
Talk("不知姑娘有何差遣？", 0, 1);
Talk("你，陪我去華山。", 91, 0);
Talk("姑娘是想去華山游玩嗎？", 0, 1);
Talk("讓你去你就去，問那么多干嗎？", 91, 0);
Talk("＜好兇的姑娘……＞", 246, 1);
Talk("聽袁大哥說，我爹的尸骨就在華山附近的一個山洞里，我現在要把我娘的骨灰帶去和我爹合葬……", 91, 0);
if AskJoin () then
ModifyEvent(46, 1, 1, 0, 318, 0, 0, -2, -2, -2, -2, -2, -2);
Talk("好，在下愿陪姑娘走一遭。", 0, 1);
if TeamIsFull() == false then
DarkScene();
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
LightScene();
Join(91);
exit();
end;
Talk("你的隊伍居然沒空位了？我去小村等你！", 91, 0);
DarkScene();
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(70, 51, 1, 0, 197, 0, 0, 7032, 7032, 7032, -2, -2, -2);
LightScene();
end;
Talk("對不起，在下還有別的事。", 0, 1);
ModifyEvent(-2, -2, 1, 0, 317, 0, 0, -2, -2, -2, -2, -2, -2);