if InTeam(72) == false then
Talk("少俠有何貴干哪？", 4, 0);
exit();
end;
AddMorality(-1);
ModifyEvent(3, 9, 1, 0, 639, 0, 0, -2, -2, -2, -2, -2, -2);
ModifyEvent(3, 12, 1, 0, 639, 0, 0, -2, -2, -2, -2, -2, -2);
ModifyEvent(3, 11, 1, 0, 639, 0, 0, -2, -2, -2, -2, -2, -2);
ModifyEvent(3, 10, 1, 0, 639, 0, 0, -2, -2, -2, -2, -2, -2);
Talk("老朋友來了，還不出來歡迎啊？", 72, 1);
Talk("呵呵，我當是誰，原來是田大俠，稀客稀客啊。", 4, 0);
Talk("你這個冒牌的跌打醫生，又在這研究什么害人的法子呢？", 72, 1);
Talk("小人這點手段，哪能瞞得了田大俠。不知田大俠此來有何貴干？", 4, 0);
Talk("這位少俠有些事情，要求你助一臂之力。", 72, 1);
Talk("這位少俠英明神武，一表人才，定是成大事之人。不知有何吩咐？", 4, 0);
Talk("哪里哪里，閻大夫過獎了。", 0, 1);
Talk("我們現在要去對付苗人鳳，如此這般……", 72, 1);
Talk("嘿嘿，您就放心好啦。", 4, 0);
ModifyEvent(104, 57, 1, 0, 947, 0, 0, 5168, 5168, 5168, -2, -2, -2);
if TeamIsFull() == false then
Talk("如此我就與你們同行吧。", 4, 0);
Join(4);
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
exit();
end;
Talk("少俠的隊伍已滿，我就直接去小村啦。如果要去對付苗人鳳，別忘了叫上我。", 4, 0);
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(70, 21, 1, 0, 105, 0, 0, 5168, 5168, 5168, -2, -2, -2);