Talk("袁公子，真沒想到在這遇見你。", 247, 1);
Talk("原來是你啊，我正要去找你呢。", 54, 0);
Talk("找我？", 0, 1);
Talk("是啊，我這些年到處游歷，無意中發現了一本奇書《碧血劍》，我想可能就是你要尋找的天書之一吧。", 54, 0);
Talk("太好了，這正是我要找的書！", 0, 1);
if CheckRoleMorality(0, 75, 999) then
AddMorality(1);
Talk("既然如此，這本書就送給你吧。", 54, 0);
Talk("哈哈，太好了，多謝袁公子！", 247, 1);
AddItem(156, 1);
Talk("看到你高興的樣子，我的心也再度活躍起來。", 54, 0);
Talk("那袁公子何不與我一同闖蕩江湖？", 0, 1);
ModifyEvent(104, 75, 1, 0, 966, 0, 0, 6818, 6818, 6818, -2, -2, -2);
if TeamIsFull() == false then
Talk("好，愿陪少俠走一遭！", 54, 0);
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
Join(54);
exit();
end;
Talk("你的隊伍已滿，我就直接去小村吧。", 54, 0);
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(70, 18, 1, 0, 145, 0, 0, 6818, 6818, 6818, -2, -2, -2);
exit();
end;
Talk("不過少俠近來在江湖上似乎做了不少不道德的事情啊……", 54, 0);
ModifyEvent(-2, -2, 1, 0, 348, 0, 0, -2, -2, -2, -2, -2, -2);