ModifyEvent(-2, -2, -2, 0, 40, 0, 0, -2, -2, -2, -2, -2, -2);
Talk("你是誰，在這做什么？", 0, 1);
Talk("唉，我叫狄云，是個不幸之人。", 37, 0);
Talk("我要找些書，隨便到這個山洞來看看。", 0, 1);
Talk("你還是早些離去的好，免得被我這個不幸之人連累。", 37, 0);
Talk("你到底發生了什么事，說來聽聽。", 0, 1);
Talk("幾年前，我隨師父和師妹到荊州去為我萬震山萬師叔祝壽，但後來卻被師叔他們誣賴我勾結盜匪，偷了他萬家的金銀珠寶，并意圖非禮小師娘。而縣府大人也沒明察秋毫，就把我關了起來。后來聽說我師父死了，我師妹。。。師妹她。。她。。竟嫁給了萬師兄。", 37, 0);
Talk("你很愛你師妹，是嗎？", 0, 1);
Talk("我師妹怎能…………怎能嫁給那個姓萬的。", 37, 0);
Talk("那你后來怎么離開那荊州大牢，又怎么會在這里？", 0, 1);
Talk("在獄中的幾年，同牢的丁典丁大哥告訴了我許多江湖上的事，也教了我”神照經”大法。", 37, 0);
Talk("神照經？聽起來很厲害的樣子……", 0, 1);
Talk("突然有一天，丁大哥帶我逃獄，說要去看一位朋友。但想不到是丁大哥的紅粉知己死了，而她父親，也就是荊州府尹，居然在她女兒的棺木上下毒，為的就是要害死丁大哥，丁大哥后來就中毒死了。而我逃走了，后來就回到了這里。這個山洞，是我和師妹以前兒時常來玩的地方。", 37, 0);
if AskJoin () then
Talk("看你也無家可歸，和我一起走吧，路上也有個照應。", 0, 1);
if CheckRoleMorality(0, 70, 100) then
AddMorality(2);
Talk("好吧！如果你不怕被我這個不幸之人連累的話。", 37, 0);
if TeamIsFull() == false then
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(104, 81, 1, 0, 956, 0, 0, 7232, 7232, 7232, -2, -2, -2);
Join(37);
exit();
end;
Talk("你的隊伍已滿，我就直接去小村吧。", 37, 0);
ModifyEvent(70, 7, 1, 0, 125, 0, 0, 5090, 5090, 5090, -2, -2, -2);
ModifyEvent(70, 8, 1, 0, 125, 0, 0, 5092, 5092, 5092, -2, -2, -2);
exit();
end;
Talk("不了！我這個不幸之人還是別害人的好。", 37, 0);
exit();
end;
if AskBattle() then
AddMorality(-2);
Talk("你說那個什么神照經，拿出來看看啊", 0, 1);
Talk("不行，這是丁大哥的遺物，不能隨便交給他人。", 37, 0);
Talk("哼，小子，不給我，我不會硬搶嗎？凡是書，我都不會放過！", 245, 1);
if TryBattle(16) == false then
Dead();
exit();
end;
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
LightScene();
AddItem(71, 1);
exit();
end;