if InTeam(1) == false then
Talk("胡斐怎么沒和少俠一起來？", 72, 0);
exit();
end;
Talk("二位考慮得如何了？", 72, 0);
Talk("大丈夫處世當光明磊落。父仇雖大，胡某也絕不做小人勾當。", 1, 1);
if AskJoin () == false then
Talk("少俠不妨再考慮考慮。", 72, 0);
exit();
end;
AddMorality(-4);
ModifyEvent(104, 84, 1, 0, 973, 0, 0, 7012, 7012, 7012, -2, -2, -2);
ModifyEvent(3, 9, 1, 0, 638, 0, 0, -2, -2, -2, -2, -2, -2);
ModifyEvent(3, 12, 1, 0, 638, 0, 0, -2, -2, -2, -2, -2, -2);
ModifyEvent(3, 11, 1, 0, 638, 0, 0, -2, -2, -2, -2, -2, -2);
ModifyEvent(3, 10, 1, 0, 638, 0, 0, -2, -2, -2, -2, -2, -2);
Talk("少俠果然英明。", 72, 0);
Talk("哼！我胡某看錯人了！告辭！", 1, 1);
DarkScene();
LeaveTeam(1);
LightScene();
Talk("唉，胡大哥，怎么那么心急啊！", 244, 1);
Talk("少俠，我們不必管他。要除掉苗人鳳，光靠你我二人還不夠，我們還要再找一個人。", 72, 0);
Talk("誰？", 0, 0);
Talk("一個跌打醫生！", 72, 0);
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(24, 0, 0, 0, 0, 0, 33, 0, 0, 0, 0, -2, -2);
ModifyEvent(50, 1, 1, 0, 32, 0, 0, 5168, 5168, 5168, -2, -2, -2);
if TeamIsFull() == false then
Join(72);
exit();
end;
Talk("你的隊伍已滿，我就直接去小村吧。", 72, 0);
ModifyEvent(70, 40, 1, 0, 159, 0, 0, 7012, 7012, 7012, -2, -2, -2);