if CheckRoleMorality(0, 80, 999) == false then
Talk("俠之大者，為國為民！", 55, 0);
Talk("靖哥哥，說得好！", 56, 0);
exit();
end;
AddMorality(1);
Talk("兄弟，你來啦，最近是否順利？", 55, 0);
Talk("唉，說實話，真是遇到了不少困難啊。", 244, 1);
Talk("靖哥哥，咱們去幫幫他吧。", 56, 0);
Talk("好，我正有此意。兄弟不必擔心，我二人這就去小村，助你一臂之力。", 55, 0);
DarkScene();
ModifyEvent(104, 45, 1, 0, 967, 0, 0, 7238, 7238, 7238, -2, -2, -2);
ModifyEvent(104, 52, 1, 0, 968, 0, 0, 7240, 7240, 7240, -2, -2, -2);
ModifyEvent(-2, 42, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(-2, 41, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(70, 13, 1, 0, 147, 0, 0, 6088, 6088, 6088, -2, -2, -2);
ModifyEvent(70, 14, 1, 0, 149, 0, 0, 6090, 6090, 6090, -2, -2, -2);
LightScene();