Talk("行走江湖，最重要的就是使自己保持在正道之上。", 68, 0);
if CheckRoleMorality(0, 90, 999) == false then
exit();
end;
DarkScene();
ModifyEvent(-2, 27, 1, 0, 0, 0, 0, 7102, 7102, 7102, -2, -2, -2);
LightScene();
WalkFromTo(38, 25, 39, 25);
WalkFromTo(39, 25, 39, 22);
Talk("晚輩參見重陽真人", 0, 1);
Talk("不必多禮。你在江湖上的事跡我早有耳聞，我今日到這里來，就是要尋找合適的傳人", 129, 0);
Talk("前輩的意思是……", 0, 1);
Talk("你的所作所為，堪稱大俠，我這先天功，就傳授給你吧！", 129, 0);
AddItem(77, 1);
ModifyEvent(-2, 27, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(-2, 0, 1, 0, 500, 0, 0, -2, -2, -2, -2, -2, -2);