Talk("行走江湖，最重要的就是使自己保持在正道之上。", 68, 0);
if CheckRoleMorality(0, 99, 999) == false then
exit();
end;
DarkScene();
ModifyEvent(-2, 27, 1, 0, 0, 0, 0, 7102, 7102, 7102, -2, -2, -2);
LightScene();
WalkFromTo(38, 25, 39, 25);
WalkFromTo(39, 25, 39, 22);
Talk("晚輩參見重陽真人", 0, 1);
Talk("不必多禮。少俠武功卓絕，更難得的是行走江湖始終保持在正道之上，不愧為當今武林第一人，這部九陰真經，只有少俠才真正有資格成為它的主人。", 129, 0);
Talk("多謝重陽真人。", 0, 1);
AddItem(84, 1);
ModifyEvent(-2, 27, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(-2, 0, 1, 0, 497, 0, 0, -2, -2, -2, -2, -2, -2);