Talk("他們說的”傻乎乎的公子哥”是怎么回事？", 0, 1);
Talk("哎呀，你不說我都忘了，是段譽段大哥，剛才還在的，不知道跑到哪里去了。應該就在這附近的，這位大哥，我們一起去找他好不好？", 90, 0);
if AskJoin () then
if TeamIsFull() == false then
Talk("好啊，我們一起走吧", 247, 1);
ModifyEvent(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
Join(90);
ModifyEvent(42, 11, 1, 0, 519, 0, 0, 6312, 6312, 6312, -2, -2, -2);
exit();
end;
Talk("你的隊伍已滿，我就直接去小村吧。", 90, 0);
ModifyEvent(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(70, 53, 1, 0, 195, 0, 0, 7038, 7038, 7038, -2, -2, -2);
ModifyEvent(42, 11, 1, 0, 519, 0, 0, 6312, 6312, 6312, -2, -2, -2);
exit();
end;
Talk("啊？像我這么可愛的女生要和你同行，居然拒絕？你是不是男人啊！", 90, 0);