Talk("小子，你又來干什么？", 130, 0);
if AskBattle() == false then
Talk("我，沒事，隨便逛逛……", 247, 1);
exit();
end;
AddMorality(-5);
Talk("前輩是否知道黑風雙煞？", 0, 1);
Talk("豈知知道！那黑風雙煞兇狠殘忍，濫殺無辜，我大哥飛天神龍就是死在他二人手上，不過我們也殺了那個銅尸陳玄風！", 130, 0);
Talk("哦，那就好了，沒找錯人，我今日來就是給陳玄風前輩報仇的。", 0, 1);
Talk("什么？？好啊，原來你和那個妖女是一路的，好啊，好啊，來吧小子！", 130, 0);
if TryBattle(189) == false then
Dead();
exit();
end;
ModifyEvent(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(41, 1, 1, 0, 516, 0, 0, -2, -2, -2, -2, -2, -2);
LightScene();