Talk("好大一只蛤蟆！", 0, 1);
if TryBattle(78) == false then
Dead();
exit();
end;
ModifyEvent(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(99, 0, 0, 0, 0, 0, 0, 6308, 6308, 6308, -2, -2, -2);
ModifyEvent(99, 1, 0, 0, 0, 0, 0, 7126, 7126, 7126, -2, -2, -2);
ModifyEvent(99, 2, 0, 0, 0, 0, 0, 7128, 7128, 7128, -2, -2, -2);
ModifyEvent(99, 3, 0, 0, 0, 0, 0, 5330, 5330, 5330, -2, -2, -2);
ModifyEvent(99, 4, 0, 0, 0, 0, 0, 7986, 7986, 7986, -2, -2, -2);
ModifyEvent(99, 7, 0, 0, 0, 0, 521, 0, 0, 0, -2, -2, -2);
LightScene();
Talk("真玄，差點成為這蛤蟆的晚餐！", 0, 1);
AddItem(26, 1);