if isUsingItem(200) == false then
exit();
end;
Talk("這……這是我逍遙派掌門之信物，怎會在閣下手中？", 45, 0);
Talk("你師祖已將逍遙派掌門傳給我兄弟了……事情是這樣的……你師父跟我們說，如果有需要醫術高明的人加入的話，可以來這邊找你。", 0, 1);
Talk("是，少俠有什麼需要，在下將全力配合。", 45, 0);
Talk("你的醫術很高明，就加入我的隊伍，日後也能幫我們治病療傷。", 0, 1);
if TeamIsFull() == false then
Talk("是。", 45, 0);
ModifyEvent(104, 58, 1, 0, 959, 0, 0, 6416, 6416, 6416, -2, -2, -2);
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
Join(45);
exit();
end;
Talk("你的隊伍已滿，我就直接去小村吧。", 45, 0);
ModifyEvent(70, 12, 1, 0, 131, 0, 0, 6416, 6416, 6416, -2, -2, -2);
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);