Talk("慕容公子，別來無恙？", 247, 1);
Talk("少俠今日來燕子塢，不知有何指教？", 51, 0);
if AskJoin () == false then
Talk("沒事，隨便逛逛……", 0, 1);
exit();
end;
Talk("不敢不敢，在下最近旅途頗有不順，想請慕容公子幫忙。", 0, 1);
Talk("＜這小子很有利用價值，幫幫他不會有壞處＞，哈哈，好說好說", 51, 0);
AddMorality(-1);
ModifyEvent(104, 44, 1, 0, 963, 0, 0, 6300, 6300, 6300, -2, -2, -2);
if TeamIsFull() == false then
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 2, 1, 0, 588, 0, 0, -2, -2, -2, -2, -2, -2);
Join(51);
exit();
end;
Talk("你的隊伍已滿，我就直接去小村吧。", 51, 0);
ModifyEvent(70, 22, 1, 0, 139, 0, 0, 7990, 7990, 7990, -2, -2, -2);
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 2, 1, 0, 588, 0, 0, -2, -2, -2, -2, -2, -2);