Talk("賢弟，我們走了吧．", 0, 1);
ModifyEvent(104, 82, 1, 0, 962, 0, 0, 7234, 7234, 7234, -2, -2, -2);
if TeamIsFull() == false then
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(28, 38, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(35, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
Join(49);
exit();
end;
Talk("你的隊伍已滿，我就直接去小村吧。", 49, 0);
DarkScene();
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(70, 10, 1, 0, 137, 0, 0, 6604, 6648, 6604, -2, -2, -2);
ModifyEvent(70, 11, 1, 0, 137, 0, 0, 6650, 6694, 6650, -2, -2, -2);
ModifyEvent(35, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
LightScene();