Talk("一呀摸，二呀摸，摸到姐姐的頭發邊……唉，我韋小寶什么時候能離開這里，一定要發大財，取一堆漂亮老婆，開個特大的妓院，哈哈……", 225, 0);
if AskJoin () == false then
exit();
end;
Add3EventNum(1, 10, 1, 0, $5);
Add3EventNum(1, 7, 1, 0, $5);
Talk("出去玩？＜這個家伙看著好像挺能打的，跟著他不會吃虧……我娘現在不在這……哈哈，就這么定了……＞，好啊，出去找漂亮老婆，好爽好爽。", 225, 0);
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
Talk("韋小寶隨隊行動", 225, 0);
ModifyEvent(71, 20, 0, 0, 0, 0, 63, 0, 0, 0, -2, -2, -2);
ModifyEvent(76, 12, 0, 0, 0, 0, 89, -2, -2, -2, -2, -2, -2);
ModifyEvent(76, 0, 1, 0, 0, 0, 0, 6292, 6292, 6292, -2, -2, -2);
ModifyEvent(76, 1, 1, 0, 0, 0, 0, 5956, 5956, 5956, -2, -2, -2);
ModifyEvent(76, 2, 1, 0, 0, 0, 0, 6306, 6306, 6306, -2, -2, -2);
ModifyEvent(76, 11, 1, 0, 0, 0, 0, 7030, 7030, 7030, -2, -2, -2);