
n=0;
for i=144,157 do
    if HaveItemBool(i) then
        n = n + 1;
    end
end
if n < 14 then
    Talk("在江湖上行走，最重要的就是使自己保持在正道之上……", 255, 0);
    exit();
end
--instruct_50e(144, 145, 146, 147, 148, 0, 173);        --instruct_50e(144, 145, 146, 147, 148, 0, 173);
--instruct_50e(149, 150, 151, 152, 153, 0, 164);        --instruct_50e(149, 150, 151, 152, 153, 0, 164);
--instruct_50e(154, 155, 156, 157, 157, 0, 155);        --instruct_50e(154, 155, 156, 157, 157, 0, 155);
Talk("年輕人，你終于找齊了十四天書？很好，你做的很好。這十四本書都是經典小說，值得你永久珍藏。", 255, 0);
Talk("你曾經和我說什么武林浩劫啊，什么天命啊，什么大事等著我啊，鬧了半天這些書僅僅是小說？？", 0, 1);
Talk("年輕人應該多讀點書，所以我讓你去找書……", 255, 0);
Talk("死老頭，你知不知道，我為了找這幾本爛書，差點送掉小命啊！！！", 245, 1);
Talk("子曾經曰過，天將降大任于斯人也，必先苦其心志，勞其筋骨……", 255, 0);
Talk("你不要和我掉書包了，沒看見我很氣憤嗎？還有什么大任，快說！！", 245, 1);
Talk("你知道華山論劍嗎？", 255, 0);
Talk("知道啊，你讓我去參加華山論劍？", 0, 1);
Talk("現在華山論劍已經取消了……", 255, 0);
Talk("你知道嗎？我現在很想揍你……", 0, 1);
Talk("年輕人就是性子急。其實華山論劍并沒有真正取消，只是改了名字，現在叫做”奧林匹克”大會。", 255, 0);
Talk("這是什么爛名字啊。", 246, 1);
ModifyEvent(-2, 0, 0, 0, 0, 0, 0, 7220, 7220, 7220, -2, -2, -2);
Talk("你錯了，這個名字很有意義。", 256, 0);
Talk("丑叔，不要突然冒出來嚇人！", 245, 1);
Talk("”奧”，就是深奧，象征武學的精深；”林”，就是森林，象征武學的博大；”匹”，就是匹敵，象公平的規則；”克”，就是克人克己，這才是武學的真諦。我當初取這個名字，是很有意義的。", 256, 0);
Talk("鬧了半天這么蹩嘴的名字是你起的！！", 246, 1);
Talk("我從前說過，有件大事等著你，絕不是騙你。現在你經過尋找十四天書的過程，已經練就了一身非凡的武功，現在就是參加”奧林匹克”大會的時候了，你挑選一下伙伴，準備好了就到華山的武道大會場來吧。", 255, 0);
OpenSubMap(25);
DarkScene();
SetSubMapLayerData(83, 1, 39, 37, 0);
ModifyEvent(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
LightScene();
exit();
Talk("在江湖上行走，最重要的就是使自己保持在正道之上……", 255, 0);