if InTeam(35) == false then
Talk("掌門已率領弟子上嵩山了。", 195, 0);
exit();
end;
Add3EventNum(40, 17, 1, 0, 0);
Add3EventNum(40, 18, 1, 0, 0);
Talk("六猴，師父呢？", 35, 1);
Talk("師父說封不平等這幾個劍宗棄徒請到了五岳劍派的令旗，咱們上嵩山去見左盟主，和他評一評這個道理。", 195, 0);
Talk("武林中說到評理，可并非單是“評”一“評”就算了事，一言不合，往往繼之以動武。", 35, 0);
Talk("師父說讓你回來好好養傷，這是師父留給你的紫霞秘笈。我也要去幫師父的忙了。", 195, 0);
AddItem(67, 1);
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
Talk("師父武功雖高，未必是左盟主的對手，何況嵩山派左盟主的師弟共有十余人之多，武林中號稱‘嵩山十三太保”咱們貿然上嵩山去生事，豈非太也鹵莽？", 35, 0);
Talk("那咱們就沿路找找他們吧，看能不能幫上什么忙。", 0, 1);
Talk("好，師父他們人多，走的慢，咱們應該能追上他們。", 35, 0);
ModifyEvent(103, 0, 0, 0, 0, 0, 760, 0, 0, 0, -2, -2, -2);
ModifyEvent(103, 2, 0, 0, 0, 0, 760, 0, 0, 0, -2, -2, -2);
ModifyEvent(103, 1, 0, 0, 0, 0, 760, 0, 0, 0, -2, -2, -2);