Talk("少俠來我王府有何貴干啊？", 106, 0);
Talk("久仰王老爺子金刀無敵的大名，今日特來拜見。", 0, 1);
Talk("呵呵呵，什么金刀無敵，江湖上的朋友往老朽臉上貼金啦，呵呵呵……", 106, 0);
if AskBattle() == false then
exit();
end;
Talk("我覺得也是，什么金刀無敵，純粹胡吹大氣。", 0, 1);
Talk("你——！小娃娃，你今日來此，是來挑釁的嗎？", 106, 0);
Talk("我就是想見識一下，什么樣的刀能叫做無敵金刀！", 0, 1);
Talk("哈哈，小娃娃，原來是來考教老朽的功夫來了，好，就讓你嘗嘗我金刀的厲害！", 106, 0);
if TryBattle(209) == false then
Dead();
exit();
end;
LightScene();
Talk("這就是金刀啊，我看也沒什么了不起嘛，我替你保管好了。", 0, 1);
AddItem(47, 1);
Talk("…………", 106, 0);
ModifyEvent(-2, -2, 1, 0, 763, 0, 0, -2, -2, -2, -2, -2, -2);
AddMorality(-5);