if InTeam(35) == false then
exit();
end;
DarkScene();
ModifyEvent(-2, 5, 1, 0, 0, 0, 0, 7170, 7170, 7170, -2, -2, -2);
LightScene();
Talk("令狐大哥，你怎么了？", 0, 1);
Talk("…………", 35, 0);
DarkScene();
ModifyEvent(-2, 6, 0, 0, 0, 0, 0, 7002, 7002, 7002, -2, -2, -2);
LightScene();
Talk("沖哥，沖哥，你怎么了？", 73, 0);
Talk("＜不是吧，沖哥？他倆那些天不光是在學琴吧……＞", 0, 1);
Talk("少俠，沖哥他怎么會這樣？", 73, 0);
Talk("我也不知道啊，我們按你說的去找平一指，可是平大夫也治不了，他說只有少林易筋經或許可以化解令狐大哥體內的真氣。于是我們就到少室山來了，剛走到這里，令狐大哥支持不住，暈倒了……", 0, 1);
Talk("多謝少俠這些日子對沖哥的照顧，我來送他上少林吧。", 73, 0);
Talk("可是你一個女子，上少林寺恐怕不方便吧？", 0, 1);
Talk("少俠放心，我自有辦法。為了沖哥，我豁出去了。", 73, 0);
DarkScene();
LeaveTeam(35);
ModifyEvent(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(-2, 4, 0, 0, 0, 0, 784, 0, 0, 0, -2, -2, -2);
LightScene();
Talk("我還是繼續找我的天書吧，以后有空再到少林看望他們。", 0, 1);
if CheckSubMapPic(37, 10, 2286) == false then
ModifyEvent(37, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
end;