if isUsingItem(214) == false then
exit();
end;
Talk("這．．．這是真跡！真是．．．真是唐朝．．．唐朝張旭的“率意帖”．．假不了，假不了的！", 32, 0);
Talk("三莊主果然是行家", 0, 1);
Talk("少俠，可否再借老夫一看？", 32, 0);
Talk("禿老頭，要看可以，先打贏我再說．", 0, 1);
Talk("說什麼？我最痛恨人家叫我禿子，你這小子太不知死活了．", 32, 0);
Talk("禿頭禿頭，下雨不愁，人家有傘，我有禿頭．", 247, 1);
Talk("好小子，我瞧你是活得不耐煩了，看看老夫怎麼收拾你．", 32, 0);
if TryBattle(44) == false then
Dead();
exit();
end;
LightScene();
AddItem(183, 1);
Talk("小伙子，果然有兩下子，可是那“率意帖”我是要定了．", 32, 0);
Talk("三莊主，別自不量力了．我看這梅莊之中也沒什麼能手了，真是害我白走一趟．", 0, 1);
Talk("四弟，咱們去求二哥幫忙．", 33, 0);
DarkScene();
ModifyEvent(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(-2, 11, 1, 0, 791, 0, 0, 6050, 6050, 6050, -2, -2, -2);
ModifyEvent(-2, 10, 1, 0, 791, 0, 0, 6054, 6054, 6054, -2, -2, -2);
SetSubMapLayerData(-2, 1, 21, 34, 0);
LightScene();