Talk("這位少俠，上泰山來不知有何見教？", 199, 0);
Talk("原來這兒就是泰山啊，古人曾說過”登泰山而小天下”今日一見果然名不虛傳．", 0, 1);
Talk("好說，好說．我泰山派立派以來，每年上山朝拜者數以萬計，多少人都想到我泰山派拜師學藝．我看，你也是想來這拜師的吧？", 199, 0);
if AskBattle() == false then
Talk("我不過是隨便逛逛，欣賞一下泰山的風光。", 0, 1);
exit();
end;
Talk("哈！哈！我還需要拜師？有沒有搞錯啊！我看你拜我為師還差不多．不然這樣好了，今兒個我心情正好，就收你為徒．咱們也不必行什麼拜師禮了．．", 0, 1);
Talk("小子！好大的口氣！我倒要看看你有多少斤兩，想叫我拜你為師！", 199, 0);
if TryBattle(25) == false then
Dead();
exit();
end;
ModifyEvent(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
LightScene();
AddMorality(-1);