if InTeam(78) then
Talk("師姐，真的是你？？", 236, 0);
Talk("默風，是我啊。這些年……你過得好嗎？", 78, 1);
Talk("自從被師父挑斷腳筋，逐出桃花島，我一直是顛沛流離，沒過過一天安穩日子啊……", 236, 0);
Talk("唉，都是我害了你……", 78, 1);
Talk("師姐，別這么說，從前得事情都已經過去了。如今能再次見到師姐，我真的很高興。", 236, 0);
Talk("默風，我看你一個人也很孤單，不如一起去小村吧。", 78, 1);
Talk("好，我聽師姐的。", 236, 0);
DarkScene();
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(70, 45, 1, 0, 847, 848, 0, 7022, 7022, 7022, -2, -2, -2);
LightScene();
exit();
end;
Talk("感謝少俠的救命之恩。", 236, 0);
Talk("前輩太客氣了。", 0, 1);
if HaveItemBool(101) == false then
Talk("真是懷念桃花島啊……", 236, 0);
exit();
end;
Talk("咦？你也曾經學過桃花島的武功嗎？", 236, 0);
Talk("是啊，晚輩有幸，得蒙黃島主傳授武功。", 0, 1);
Talk("這么說來，我們也算是師兄弟了。你有什么需要我幫忙的，盡管說。", 236, 0);
Talk("那能否請前輩到小村去，幫我打造一些兵器。", 0, 1);
Talk("好，咱們這就走！", 236, 0);
DarkScene();
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(70, 45, 1, 0, 847, 848, 0, 7022, 7022, 7022, -2, -2, -2);
LightScene();