//function oldevent_699()
instruct_52();   //  52(34):看道德
runsql('update item set 仅修炼人物=-1 where 物品类型=2');

//print(getrole(0, "生命"))
//setrole(0, "生命", 995)
//setrole(0, "名字", "闪避")

//randomseed();
n = getitemcountinbag(182);
if (n>=2)
{
    k=n-2;
    newtalk("你已勝"+tostring(k)+"場。",300,0);
    array[0]=219;
    array[1]=79;
    array[2]=1;
    array[3]=2;
    //array={219,79,1,2,58,166,220,226,23,27,39,40,41,48,49,87,203,222,96,61,62,64,65,8,25,29,43,69,70,208,97,3,16,18,44,52,53,59,76,77,132,145,157,158,159,178,179,180,181,182,204,209,99,30,31,32,35,36,45,50,51,85,102,141,151,164,46,78,101,103,212,215,63,88,104,201,4,7,33,37,42,82,94,105,136,144,156,160,167,190,205,211,225,98,163,89,106,66,0,10,20,21,34,75,84,92,107,135,137,143,149,150,161,168,169,171,206,224,108,9,11,12,47,109,162,192,110,221,111,24,26,28,60,67,93,100,112,113,138,146,172,173,174,188,193,197,198,213,216,71,72,114,115,202,194,14,19,116,147,148,117,5,15,38,55,68,86,91,118,139,142,152,155,165,175,189,191,195,210,119,120,121,90,122,73,95,123,140,153,199,207,124,125,17,126,127,13,22,56,128,154,176,177,187,196,200,214,217,218,223,129,130,131,6,74,81,183,54,57,83,133,134,170,184,186,185,80}
    k = n + random(0, 10);
    if (k < 1)
    {
        k = 1;
    }
    if (k>array.size())
    {
        k = array.size() - 10 + random(0, 10);
    }
    if (trybattle(array[k], 0))
    {
        m = random(0,236)
        while (getitem(m,"物品类型")==0) 
            m = random(0,236);    
        additem(m,1);
        additem(174, k);
        additemwithouthint(182, 1);
        additemwithouthint(209, random(0, 5));
        additemwithouthint(210, random(0, 5));
    }
    else {}
    //additemwithouthint(199, 1);
    //autosave()
}
else
{
//function oldevent_691()
    newtalk("哈哈哈哈哈！",300,0);
    newtalk("我靠吓我一跳！",0,1);
    instruct_27(1,6862,6888);
    newtalk("这里是金庸群俠傳黑帝斯，可以瞎玩了！",300,0);
    newtalk("黑帝斯？不是哈迪斯嗎？",0,1);
    newtalk("這次作者比較裝逼，查了半天感覺哈迪斯是個錯誤翻譯，應該叫哈得斯才對。",300,0);
    newtalk("那你就叫哈得斯啊！",0,1);
    newtalk("但是感覺黑帝斯這個名字比較霸道。",300,0);
    newtalk("無聊的作者……那封面那個二貨是誰啊？",0,1);
    newtalk("那個是中山靖王劉勝，人送綽號大舅哥的。",300,0);
    newtalk("啥？我不信他還會PS。",0,1);
    newtalk("那你還真說對了，圖是蘊殊小姐姐處理的。",300,0);
    newtalk("啊小姐姐！",0,1);
    newtalk("滾！",300,0);
    newtalk("……好了，說點有用的。這次咋玩？",0,1);
    newtalk("這次是模仿爆款游戲黑帝斯的一個即時動作戰鬥系統。在戰鬥時，用wasd控制方向，ijkm表示裝備的4個武學。其中j是輕擊，威力較小，所有武功都能用。i爲重擊，會連續打出幾個攻擊，一般只適用于面攻擊。k爲遠程，一般只能用于綫攻擊。m爲閃身幷在路徑上多次攻擊。",300,0);
    newtalk("就是說只能用4個武功？",0,1);
    newtalk("沒錯，根據我們考證，你平常也就用一兩種武功。",300,0);
    newtalk("劇情沒改？",0,1); 
    newtalk("你跑劇情也行，在我這裏打無限戰鬥也行。我會根據你現在的實力，給你安排對應難度的戰鬥。贏了你會隨機得到物品，打不過你就自己跑劇情叫隊友來幫忙。",300,0);
    newtalk("感覺作者很懶。",0,1);
    newtalk("恭喜你答對了！（考慮滅口）",300,0);
    newtalk("發現游戲不合理咋辦？",0,1);
    newtalk("不合理很正常，可以到這項個目的地址：https://github.com/scarsty/kys-cpp，或者論壇https://tiexuedanxin.net/反饋。",300,0); 
    newtalk("另外你記得戰鬥前裝備武功！",300,0);
    additemwithouthint(182, 1);
    additem(112,1);
    additem(134,1);
    additem(166,1);
    additem(186,1);
}