Talk("看你的樣子，妳大概就是金花婆婆吧．快放了王前輩，否則要你吃不完兜著走．", 0, 1, 388);
Talk("胡青牛老眼昏花了是不是，叫了個小子來送死．小子，我看你年紀輕輕的，快走吧，別自討苦吃了．", 15, 0, 389);
Talk("你活生生的拆散人家夫妻，我就是看不慣，這檔事我管定了．", 0, 1, 390);
Talk("本來想這不關你的事，你非要管，我就讓你這不知天高地厚的小子吃點苦頭．", 15, 0, 391);
if TryBattle(14) then
ModifyEvent(-2, -2, -2, -2, 100, -1, -1, -2, -2, -2, -2, -2, -2);
SetSubMapLayerData(-2, 1, 21, 17, 0);
LightScene();
Talk("老婆婆，我想請問你天有多高，地有多厚啊？我真的不知道耶！", 0, 1, 392);
Talk("哼！", 15, 0, 393);
AddFame(3);
exit();
end;
ModifyEvent(-2, -2, -2, -2, 102, -1, -1, -2, -2, -2, -2, -2, -2);
LightScene();
Talk("看你資質挺好的，老婆婆我不想殺你，你走吧．", 15, 0, 387);