Talk("前輩是崆峒派掌門吧．晚輩雲遊江湖，聽聞崆峒派七傷拳神乎奇技，不知是否有榮幸見識見識．", 0, 1, 485);
Talk("小兄弟，還算有點見識，知道我七傷拳的奧妙．要知我七傷拳中拳力剛中有柔，柔中有剛，七般拳勁各不相同，吞吐閃爍，變化百端，敵手委實難防難擋．．．小兄弟還是別見識的好．", 8, 0, 486);
if InTeam(9) == false then
if AskBattle() == false then
ModifyEvent(-2, -2, -2, -2, 127, -1, -1, -2, -2, -2, -2, -2, -2);
exit();
end;
Talk("該不會是掌門您七傷拳練的火侯不夠，才不敢拿出來見人吧？", 0, 1, 487);
Talk("小子，你自尋死路．", 8, 0, 488);
if TryBattle(16) == false then
Dead();
exit();
end;
LightScene();
Talk("我說你火侯不夠還不相信，再多練個幾年吧．", 0, 1, 489);
Talk("哼！小兄弟留下個字號，他日我唐文亮再向你請教．", 8, 0, 490);
Talk("字號？好吧，記著，”軟世派河洛分舵”金庸堂堂主是也．", 0, 1, 491);
Talk("”軟世派河洛分舵”？沒聽過．", 8, 0, 492);
ModifyEvent(-2, -2, -2, -2, 128, -1, -1, -2, -2, -2, -2, -2, -2);
AddFame(3);
exit();
end;
Talk("大哥，我聽我義父說過，這七傷拳若是內力修為不足之人練之，練之反而有害．我看這崆峒掌門顯然已受了內傷，七傷拳想必修練的也不怎麼樣，不看也罷．", 9, 1, 493);
Talk("不知這位兄弟的義父是誰，竟能對我崆峒派的絕技有高明意見．", 8, 0, 494);
Talk("他義父是金毛獅王謝．．．", 0, 1, 495);
Talk("魔教的謝遜在那裡？你是他的義子，先拿下再說．", 8, 0, 496);
Talk("完了，說溜了嘴．", 0, 1, 497);
Talk("大哥，打就打吧．", 9, 1, 498);
if TryBattle(16) == false then
Dead();
exit();
end;
LightScene();
Talk("賢弟，果真不怎麼樣．", 0, 1, 499);
Talk("哼！你們現在不殺我，到時我六大派聯手，非把你魔教剿滅不可．", 8, 0, 500);
ModifyEvent(-2, -2, -2, -2, 128, -1, -1, -2, -2, -2, -2, -2, -2);
AddFame(3);