if InTeam(29) then
Talk("田伯光！你這惡賊，我跟你拼了！", 28, 0, 1062);
if TryBattle(52) == false then
Dead();
exit();
end;
ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
LightScene();
AddMorality(-5);
exit();
end;
Talk("看先生家中擺設，似乎是位大夫．", 0, 1, 1027);
Talk("小子，你到我平一指家中做什麼？", 28, 0, 1028);
Talk("平一指？難道你就是江湖中傳說的”殺人名醫”平一指．是怎麼說來著，對了，”醫一人，殺一人．  殺一人，醫一人．醫人殺人一樣多，蝕本生意絕不做．”", 0, 1, 1029);
Talk("你是來找我求醫的是嗎？", 28, 0, 1030);
Talk("目前小爺我身體無恙．", 0, 1, 1031);
Talk("那就快滾．", 28, 0, 1032);
if AskJoin () == false then
Talk("滾就滾，兇什麼兇，又不是死了女兒．", 0, 1, 1039);
ModifyEvent(-2, -2, -2, -2, 300, -1, -1, -2, -2, -2, -2, -2, -2);
exit();
end;
Talk("雖然我目前沒什麼病痛，但難保以後路程上會出什麼差錯，你就跟著我一起走吧", 0, 1, 1033);
Talk("你知道我的外號？", 28, 0, 1034);
Talk("不是”殺人名醫”嗎？", 0, 1, 1035);
Talk("知道就好．你如果要我加入你，你得先幫我去殺一個人．", 28, 0, 1036);
Talk("誰？", 0, 1, 1037);
Talk("萬里獨行田伯光那個淫蟲．", 28, 0, 1038);
ModifyEvent(-2, -2, -2, -2, 302, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(59, 0, -2, -2, 307, -1, -1, -2, -2, -2, -2, -2, -2);