Talk("少俠近來如何？", 59, 0, 1509);
if AskJoin () == false then
Talk("一切還好，你們還好吧？", 0, 1, 1515);
Talk("嗯．", 59, 0, 1516);
Talk("你們倆真是令人羨慕的神仙俠侶．", 0, 1, 1517);
exit();
end;
Talk("近日旅途有些不順，此次前來是想請龍姑娘加入，助我一臂之力．", 0, 1, 1510);
Talk("好啊，我夫婦倆受你這麼大的恩惠，理應幫忙你一些．", 59, 0, 1511);
Talk("真是不好意思，打擾了妳跟楊兄的清靜．", 0, 1, 1512);
Talk("沒有關係，等解決了你的問題後，再回來古墓就好了．", 59, 0, 1513);
Talk("謝謝你的幫忙．", 0, 1, 1514);
DarkScene();
if TeamIsFull() then
Talk("你的隊伍已滿，我無法加入．", 59, 0, 175);
exit();
end;
ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
LightScene();
Join(59);