Talk("閣下為何硬闖我全真教．", 68, 0);
Talk("前輩是丘掌門吧，我聽說先師王重陽武功天下第一，所以想看看他所創的全真教是否同他一樣厲害．", 0, 1);
Talk("廢話少說，動手吧．", 68, 0);
if TryBattle(74) == false then
LightScene();
Talk("就這麼一點微末道行，也敢到我重陽宮撒野．", 68, 0);
Talk("在下的確是自不量力，但人在江湖，身不由己啊！為了找那幾本書，我只有硬著頭皮四處踢館，看能不能有什麼收穫．", 0, 1);
if CheckRoleMorality(0, 50, 100) == false then
Talk("就算功夫不行，也不能四處為惡，如果下次見到你時，你還陷入邪道之中，老道就要開殺戒了．", 68, 0);
ModifyEvent(-2, -2, -2, -2, 458, -1, -1, -2, -2, -2, -2, -2, -2);
exit();
end;
Talk("看你的本質還不壞，但武功太差了，這樣怎麼在江湖上混呢？我送你本秘笈，你拿去好好鑽研吧．", 68, 0);
Talk("謝謝道長．", 0, 1);
AddItem(70, 1);
ModifyEvent(-2, -2, -2, -2, 458, -1, -1, -2, -2, -2, -2, -2, -2);
exit();
end;
ModifyEvent(-2, -2, -2, -2, 459, -1, -1, -2, -2, -2, -2, -2, -2);
LightScene();
AddFame(5);