Talk("很抱歉，敝教丘掌門現正閉關中，重陽宮恕不接客．", 95, 0, 1621);
if AskBattle() == false then
Talk("真是不巧，那只好改天再登門拜訪了．", 0, 1, 1623);
exit();
end;
Talk("那只好得罪了，因為裡面搞不好有我要的東西．", 0, 1, 1622);
if TryBattle(73) == false then
Dead();
exit();
end;
ModifyEvent(-2, 1, -2, -2, 456, -1, -1, 6114, 6114, 6114, -2, 31, 48);
ModifyEvent(-2, 2, -2, -2, 456, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 3, -2, -2, 456, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 4, -2, -2, 456, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 5, -2, -2, 456, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 6, -2, -2, 456, -1, -1, -2, -2, -2, -2, -2, -2);
LightScene();
AddFame(1);