Talk("金輪法王，快將可蘭經交出來．", 0, 1, 2353);
Talk("看你有沒有這個本事拿．", 62, 0, 2354);
if TryBattle(100) == false then
Dead();
exit();
end;
ModifyEvent(-2, 3, -2, -2, 632, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 5, -2, -2, 634, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 6, -2, -2, 634, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 7, -2, -2, 634, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 8, -2, -2, 634, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 9, -2, -2, 634, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 12, -2, -2, 634, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 13, -2, -2, 634, -1, -1, -2, -2, -2, -2, -2, -2);
LightScene();
Talk("老禿賊，遇到我算你倒霉．", 0, 1, 2355);
Talk("哼！", 62, 0, 2356);
AddItem(159, 1);
AddFame(8);