if InTeam(58) then
Talk("小妹妹，怎麼一個人躲在這?", 118, 0);
Talk("大哥哥!我為了找你跑片整個中原，找你找的好久，大哥哥別拋棄襄兒好嗎?", 133, 0);
if AskJoin () == false then
Talk("就跟你說我認識楊過，你不信", 0, 0);
exit();
end;
if TeamIsFull() == false then
Talk("楊兄，我看這小丫頭為了找你真的很辛苦，就讓他跟我們一起走吧!", 0, 0);
DarkScene();
ModifyEvent(-2, -2, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
LightScene();
Join(95);
exit();
end;
Talk("你的隊伍已滿，我無法加入．", 133, 0);
exit();
end;
Talk("<這小女孩好萌啊!>小妹妹 你怎麼一個人在在這個山洞", 0, 0);
Talk("我為了找我的大哥哥四處云游，對了!你認識他嗎?他很容易認的...獨臂，鬢角泛白，背後背著又黑又重的巨劍，有時旁邊會跟著一之大鵰", 133, 0);
Talk("你說的人應該就是神鵰大俠楊過吧!", 0, 0);
Talk("對，你知道他的下落嗎?", 133, 0);
Talk("楊過我當然認識，要不要我帶你一起去找他?", 0, 0);
if AskJoin () == false then
Talk("不了，我還是在這里等他<有了金輪法王的前車之監，我還是別認相信人好了>", 133, 0);
exit();
end;
Talk("不了，我還是在這里等他<有了金輪法王的前車之監，我還是別認相信人好了>", 133, 0);