if InTeam(35) then
Talk("大師，我這位朋友令狐沖體內受到多道異種真氣影響，生命危在旦夕，希望大師能出手救救他。", 0, 0);
Talk("恩，待我觀來。令狐施主，要化解你體內的真氣不難，但因這幾道真氣在你體內造成你的經脈受損，因此只有易筋伐髓，重塑經脈，方可醫治。兇險非常。只是易筋伐髓之時，腦中異像紛亂，只有斷絕雜念，放下執著，方可渡此難關。", 110, 0);
Talk("一切但憑神僧差遣，我令狐沖乃江湖浪蕩子一個 生死由天，就算中間出了什麼差錯，我令狐沖也絕不會有任何一句怨言。", 35, 0);
Talk("施主既有此明悟，老僧不妨勉力一試。令狐施主，留神!", 110, 0);
DarkScene();
ModifyEvent(-2, -2, -2, -2, 1182, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(30, 0, -2, -2, 302, -1, -1, -2, -2, -2, -2, -2, -2);
LightScene();
Talk("多謝神僧再造之恩。", 35, 0);
AddMaxHP(35, 600);
AddMaxMP(35, 500);
AddAttack(35, 20);
exit();
end;
Talk("大師真是深藏不露", 0, 0);