Talk("喂!你有看到一個禿頭和尚從這邊經過嗎?不可能無緣無故消失啊!", 0, 0);
Talk("我．．．沒看到，不過我想你說的那個和尚從我後面這個通道下去了。", 145, 0);
if AskJoin () == false then
exit();
end;
if InTeam(9) == false then
Talk("小騷貨看來很了解這個密道麻，為我帶路吧!", 0, 0);
Talk("．．．．．．", 145, 0);
exit();
end;
if TeamIsFull() == false then
Talk("你既然知道這里有個密道，想必你也應該對這個密道很熟，你愿意為我帶路嗎?", 0, 0);
Talk("是啊，姑娘能為我們帶路嗎?", 9, 0);
Talk("小昭愿為公子效勞。", 145, 0);
DarkScene();
ModifyEvent(-2, -2, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(13, 8, 0, -2, -1, -1, 1180, -2, -2, -2, -2, -2, -2);
ModifyEvent(13, 9, 0, -2, -1, -1, 1180, -2, -2, -2, -2, -2, -2);
ModifyEvent(13, 10, 0, -2, -1, -1, 1180, -2, -2, -2, -2, -2, -2);
LightScene();
Join(114);
exit();
end;
Talk("你的隊伍已滿，我無法加入．", 145, 0);