if InTeam(37) == false then
Talk("水笙姑娘，你怎麼還在這雪山，你不是回去找你爹跟表哥了嗎?", 0, 0);
Talk("嗚嗚~~~", 154, 0);
exit();
end;
Talk("狄大哥，我就知道你一定會回來這里。", 154, 0);
Talk("水笙姑娘，你怎麼還在這雪山，你不是回去找你爹跟表哥了嗎?", 37, 0);
Talk("我回家後，他們都說要殺了你，我替你澄清你是個君子，不是淫賊，他們卻說．．．嗚嗚嗚。", 154, 0);
Talk("哀，君子二字我怎麼敢當，你何必為我這個卑賤人受到如此多的委屈，裝的對我憤憤不平，要殺了我的樣子不就好了。", 37, 0);
Talk("狄兄，看來這水姑娘．．．阿哈!", 0, 0);
Talk("．．．．．．", 37, 0);
if AskJoin () == false then
exit();
end;
Talk("水姑娘，要不要一起走，可以跟你的狄大哥一起闖蕩江湖歐。", 0, 0);
if TeamIsFull() then
Talk("你的隊伍已滿，我無法加入．", 154, 0);
exit();
end;
Talk("．．．．．．", 154, 0);
DarkScene();
ModifyEvent(-2, -2, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
LightScene();
Join(17);