Talk("等等!", 144, 0);
Talk("忽蘭妃殿下，有何事?", 0, 0);
Talk("我想了又想，我還是想跟你學武功，成為一個武功高手，所以我要跟你走", 144, 0);
Talk("什麼!", 0, 0);
Talk("你們漢人的武功都要拜師才能學吧，我現在正式跟你拜師!", 144, 0);
if AskJoin () == false then
Talk("大汗對我這麼好，我怎麼能拐走他的老婆，我看你們那國師金輪法王武功不錯，想學武功找他", 0, 0);
ModifyEvent(-2, 11, -2, -2, 1162, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 12, 0, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 13, 0, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
AddMorality(1);
exit();
end;
if TeamIsFull() == false then
Join(115);
ModifyEvent(-2, 11, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 12, 0, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 13, 0, -2, 0, 0, 0, -2, -2, -2, -2, -2, -2);
Talk("我拐了成吉思汗的老婆，會不會太沒品了點，算了，有炮可推直需推，末待無炮推時空打槍", 0, 0);
AddMorality(-1);
exit();
end;
Talk("你的隊伍已滿，我無法加入．", 144, 0);