if InTeam(55) == false then
Talk("蓉兒!你別再傷心了", 0, 0);
Talk("大哥，靖哥哥真的會當那個金刀駙馬嗎?嗚~~", 137, 0);
Talk("我看蓉兒比那啥華箏公主美多了，我想郭兄弟也是這麼認為，只是我想郭兄弟想拒這門婚事絕也拒絕不了", 0, 0);
Talk("那大汗對靖哥哥恩重如山，靖哥哥又怎麼忍心弗了大汗的好意", 137, 0);
Talk("蓉兒，這世上除了郭兄弟對你好，別忘了我也會對你好", 0, 0);
Talk("大哥，嗚~~~", 137, 0);
Talk("舊的不去新的不來，初戀總是苦澀的，我會慢慢撫平你心中的創傷", 0, 0);
if AskJoin () == false then
exit();
end;
if TeamIsFull() then
Talk("你的隊伍已滿，我無法加入．", 137, 0);
exit();
end;
Talk("別窩在桃花島上，跟我到處走走散散心會開心一點", 0, 0);
ModifyEvent(-2, -2, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
LightScene();
Join(56);
exit();
end;
Talk("蓉兒，你別再生氣了，那金刀駙馬是大汗的命令，我也沒辦法違背", 55, 0);
Talk("我知道大汗對你有恩，但你不拒絕你就要跟那華箏公主成婚了", 137, 0);
Talk("不管怎樣，我心理只有蓉兒你一個!", 55, 0);
Talk("郭兄弟真貪心，左擁右抱好不快活，魚與熊掌豈能兼得，灑脫點二選一吧", 0, 0);
Talk("我．．．", 55, 0);
Talk("．．．．．．", 137, 0);