if InTeam(9) == false then
Talk("趙姑娘好啊!", 0, 1);
Talk("你來做什麼？我是叫張無忌來找我，不是你，滾。", 194, 0);
exit();
end;
Talk("趙姑娘，在下依約前來，不知姑娘有何吩咐。", 9, 5);
Talk("好，第一件事情很簡單，你一定做得到 ，那就是你闖蕩江湖時要把我帶在身邊，這麼簡單的事情應該做得到吧!", 194, 0);
Talk("這．．．好，我答應你就是，還有呢?", 9, 5);
if InTeam(114) then
Talk("還有你的侍女小昭，以後你可不準娶她，這樣既沒有違反你所謂的正道，也沒有叫你做啥不義之事。", 194, 0);
Talk("你．．．好．．．我答應。", 9, 5);
Talk("公子．．．", 145, 1);
end;
if InTeam(49) then
Talk("無忌兄弟，你放心，小昭我會好好照顧的，你也知道我的為人，我平常就熱心助人．．．", 49, 5);
Talk("你還是去吃你的大便吧!", 0, 1);
end;
Talk("暫時就這樣，剩下的事等我想到在跟你說，嘻嘻", 194, 0);
if AskJoin () == false then
Talk("怎麼?想反悔?", 194, 0);
exit();
end;
if TeamIsFull() then
Talk("你的隊伍已滿，我無法加入．", 194, 0);
exit();
end;
Talk("趙姑娘，歡迎你加入我的K隆小隊，我以隊長軍曹的名義歡迎你．", 0, 1);
DarkScene();
ModifyEvent(-2, -2, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
LightScene();
Join(39);