if InTeam(29) then
Talk("小子，你知道令狐沖在哪嗎?我老田來找他較量了．", 29, 0);
Talk("大師兄被師父處罰到思過崖去面壁了．", 81, 0);
ModifyEvent(-2, 2, -2, -2, 192, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 3, -2, -2, 192, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 4, -2, -2, 192, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 5, -2, -2, 192, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 6, -2, -2, 192, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(81, 0, -2, -2, -2, -2, 283, -2, -2, -2, -2, -2, -2);
exit();
end;
Talk("聽說日月魔教的教主東方不敗武功高強，但我五岳劍派連成一氣，定能瓦解魔教．", 81, 0);