if InTeam(35) then
Talk("恒山掌門令狐沖，前來拜見左師伯．", 35, 5);
Talk("我瞧瞧，這不是統領數百尼姑，享盡艷福的令狐師弟嗎?怎麼?今天并派大會也想參加啊．", 55, 0);
Talk("大會快開始了，請師兄讓路．", 35, 5);
Talk("不讓就是不讓，你打我啊有種你就打我啊．", 55, 0);
Talk("老子就打你!", 0, 1);
if TryBattle(29) == false then
Dead();
exit();
end;
LightScene();
Talk("這種要求，這一輩子從沒有聽過．", 0, 1);
ModifyEvent(-2, 1, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 2, -2, -2, 205, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 3, -2, -2, 205, -1, -1, -2, -2, -2, -2, -2, -2);
exit();
end;
Talk("今天嵩山頂上似乎很熱鬧？", 0, 1);
Talk("又是你！今日是我五岳劍派并派的大日子．閑雜人等，還請離去．", 55, 0);
Talk("這樣大的盛會，怎能少得了大爺我．快讓讓．", 0, 1);
Talk("閣下再不離去，休怪我們不客氣了．", 14, 0);
Talk("我正有此意．", 0, 1);
if TryBattle(29) == false then
Dead();
exit();
end;
ModifyEvent(-2, 1, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 2, -2, -2, 205, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 3, -2, -2, 205, -1, -1, -2, -2, -2, -2, -2, -2);
LightScene();
AddFame(2);