if HaveItemBool(79) == false then
if InTeam(29) then
Talk("小子，你知道令狐沖在哪嗎?我老田來找他較量了．", 29, 0);
Talk("大師兄被師父處罰到思過崖去面壁了．", 81, 0);
ModifyEvent(-2, 2, -2, -2, 725, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 3, -2, -2, 725, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 4, -2, -2, 725, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 5, -2, -2, 725, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 6, -2, -2, 725, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(81, 0, -2, -2, -2, -2, 283, -2, -2, -2, -2, -2, -2);
exit();
end;
Talk("師父說我華山派從今日起，在我五岳派中所負的責任是更重大的．我們要好好練武，過些時候好攻上黑木崖，消滅萬惡的日月魔教．", 81, 0);
exit();
end;
Talk("師父說我華山派從今日起，在我五岳派中所負的責任是更重大的．我們要好好練武，過些時候好攻上黑木崖，消滅萬惡的日月魔教．", 81, 0);