if InTeam(35) then
Talk("好啊，這兒有三鍋頭的陳年汾酒。唔，這百草酒只怕已有七十五年，那猴兒酒更是難得。", 35, 0);
Talk("妙極，妙極！這位兄弟一進我酒室，便將我所藏三種最佳名釀報了出來，當真是大名家，了不起！了不起！", 31, 0);
Talk("前輩所藏，豈止名釀三種而已。這紹興女兒紅固是極品，這西域吐魯番的葡萄酒，四蒸四釀，在當世也是首屈一指的了。", 35, 0);
Talk("我這吐魯番四蒸四釀葡萄酒密封于木桶之中，老弟怎地也嗅得出來？", 31, 0);
Talk("這等好酒，即使是藏于地下數丈的地窖之中，也掩不住它的酒香。", 35, 0);
Talk("像你這等見識，才配品嘗我莊中所釀的美酒，我丹青生先乾為敬!", 31, 0);
Talk("不瞞四莊主，聽說梅莊四莊主乃書畫大家，我旁邊這位朋友因緣巧合得到一幅畫，希望四莊主能幫我監定。", 35, 0);
Talk("歐，是什麼樣的畫，拿出來給我瞧瞧。", 31, 0);
ModifyEvent(-2, -2, -2, -2, 303, 248, -2, -2, -2, -2, -2, -2, -2);
exit();
end;
Talk("你還不走！在這兒羅嗦什麼！", 31, 0);