if InTeam(29) == false then
exit();
end;
Talk("令狐兄，我老田上華山來找你喝酒拉．", 29, 0);
ModifyEvent(-2, 3, 1, 1, 200, 238, -1, 7624, 7624, 7624, -2, -2, -2);
ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
WalkFromTo(48, 36, 17, 37);
Talk("田兄和這位兄弟遠道過訪，當真意想不到。", 35, 0);
Talk("聽說令狐兄在思過崖上坐牢，嘴里一定淡出鳥來，小弟帶了一百斤燒刀子來，來和令狐兄喝個痛快。", 29, 0);
Talk("將這一百斤酒挑上華山絕頂，這份人情可大得很啦！來來來，咱們便來喝酒。", 35, 0);
ModifyEvent(58, 0, -2, -2, 182, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(58, 20, -2, -2, 182, -2, -2, -2, -2, -2, -2, -2, -2);