if InTeam(38) then
Talk("石中玉?好大的膽子，在雪山派干下如此惡行還敢回來?", 90, 0);
Talk("出了什么事？石中玉!你這逆徒居然還敢上雪山派!", 58, 0);
Talk("我叫狗雜種，我不是石中玉．", 124, 0);
if TryBattle(58) == false then
Dead();
end;
ModifyEvent(-2, 0, 0, 0, -1, -1, 344, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 1, 0, 0, -1, -1, 344, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 2, 0, 0, -1, -1, 344, -1, -1, -1, -2, -2, -2);
LightScene();
exit();
end;
Talk("來者何人，可知這里是凌霄城．", 90, 0);
Talk("小弟有事想求見貴派掌門．", 0, 1);
Talk("掌門師叔現下不見客．", 90, 0);
Talk("在下并無惡意，煩請這位大哥通報一聲．", 0, 1);
Talk("出了什么事？", 58, 0);
Talk("封師叔，此人要求見掌門。", 90, 1);
Talk("本派今有大事要辦，快快離去，別在這羅嗦．", 58, 0);
if AskBattle() == false then
exit();
end;
Talk("閣下莫非是“風火神龍”封萬里？實在對不起，在下一定得見見貴派掌門．", 0, 1);
Talk("既然識的封某還想硬闖？真當我是廢人不成！", 58, 0);
if TryBattle(58) == false then
Dead();
exit();
end;
ModifyEvent(-2, 0, 0, 0, -1, -1, 344, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 1, 0, 0, -1, -1, 344, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 2, 0, 0, -1, -1, 344, -1, -1, -1, -2, -2, -2);
LightScene();
Talk("封前輩，對不住了。在下實在無意冒犯，還請見諒。", 0, 0);
Talk("少廢話，封某既然敗了，無話可說……唉，難道我真得不行了！", 58, 1);
AddFame(1);