Talk("外敵來襲，重陽宮恕不接客", 95, 0);
if AskBattle() == false then
Talk("真是不巧，那只好改天再登門拜訪了．", 0, 1);
exit();
end;
Talk("這熱鬧我可不能不瞧。", 0, 1);
Talk("師兄，咱們也湊個熱鬧。", 51, 1);
if TryBattle(73) == false then
Dead();
exit();
end;
ModifyEvent(-2, 1, -2, -2, 456, -1, -1, 6114, 6114, 6114, -2, 31, 48);
ModifyEvent(-2, 2, -2, -2, 456, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 3, -2, -2, 456, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 4, -2, -2, 456, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 5, -2, -2, 456, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 6, -2, -2, 456, -1, -1, -2, -2, -2, -2, -2, -2);
LightScene();
Talk("霍都和達爾巴，全真教一定遇上大麻煩了！", 0, 0);
AddFame(1);