if InTeam(9) == false then
Talk("趙姑娘氣色真不錯啊!", 0, 1);
Talk("張無忌呢？我要見他", 194, 0);
exit();
end;
Talk("哼，虧你還有臉來見我？", 9, 1);
Talk("怎麼啦？我甚麼地方得罪張大教主啦？", 194, 0);
Talk("你要盜那倚天劍和屠龍刀，我不怪你！你將我拋在荒島之上，我也不怪你！可是可是義父雙眼失明行動不變，你卻也將他擄去并交給少林寺，似你這等狠毒的女子，當真天下少見。", 9, 1);
Talk("你說我盜了倚天劍和屠龍刀，是誰見來？誰說我擄走了謝老爺子并把他交給少林寺，你叫她來跟我對質。", 194, 0);
Talk("是我！我就讓你到陰間對質去。", 9, 1);
Talk("住手!", 0, 5);
if TryBattle(248) == false then
end;
LightScene();
Talk("大哥，為啥要出手，讓我除了這個禍害。", 9, 1);
Talk("無忌兄弟你冷靜想想，其實那天發生的事情有很多破綻，別被一時的怒氣沖昏頭。", 0, 5);
Talk("除了她還會有誰，難道是心地善良的周姑娘嗎?", 9, 1);
Talk("原來周姑娘心地善良，我就心如蛇蠍。張無忌，你往哪里?", 194, 0);
Talk("我去哪跟你有甚麼相干？", 9, 1);
Talk("你是要去少林寺救謝大俠吧，正好我有話要問謝大俠，請你帶我去見他。", 194, 0);
Talk("我義父下手不容情，你這不是去送死？", 9, 1);
Talk("你義父心狠手辣，可不似你這等糊涂。再說，謝大俠殺了我，豈不是正好償了你的心愿？", 194, 0);
Talk("我糊涂什麼？我不愿你去見我義父。", 9, 1);
Talk("張無忌，你這糊涂小子，你心中實在舍不得我，不肯讓我去給謝大俠殺了，是也不是？", 194, 0);
ModifyEvent(-2, -2, -2, -2, 475, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(28, 51, 0, -2, -2, -2, 724, -2, -2, -2, -2, -2, -2);