if InTeam(53) then
Talk("嗨，小妞，請問要怎麼到燕子塢，我過不去啊!", 0, 0);
Talk("你是誰?為何要到燕子塢?", 158, 0);
Talk("這位姐姐，我和我朋友對慕容公子聞名已久，路經此地，特地來求見，小娘子是公子府上何人？該當如何稱呼才是？", 138, 0);
Talk("啊唷！我是服侍公子撫琴吹笛的小丫頭，叫做阿碧。你勿要大娘子、小娘子的介客氣，叫我阿碧好哉！從這里去燕子塢琴韻小筑，都是水路，倘若這公子和這位．．．通通要去，我劃船相送．", 158, 0);
Talk("勞煩阿碧姑娘了。", 138, 0);
Talk("<干，怎麼我要進去就一附勉強的樣子。>", 0, 0);
DarkScene();
ModifyEvent(-2, -2, -2, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 7, 1, -2, 999, -1, -1, 6086, 6086, 6086, -2, -2, -2);
OldSetScenePosition(36, 28);
LightScene();
exit();
end;
Talk("嗨，小妞，請問要怎麼到燕子塢，我過不去啊!", 0, 0);
Talk("．．．．．．", 158, 0);
exit();