if InTeam(37) == false then
Talk("．．．．．．", 120, 0);
exit();
end;
Talk("血刀老祖!你將水笙姑娘擄到哪去了", 37, 0);
Talk("這不是我的好徒孫嗎?等本老祖把那騷蹄子享用完後，老祖再跟你分享", 120, 0);
Talk("狄大哥，當日是我誤會你，你快走吧，你打不過血刀老祖", 154, 0);
Talk("打不打的過，打過才知道", 37, 0);
Talk("要幫你嗎？兄弟？", 0, 0);
Talk("不用了，就讓血刀老祖嘗嘗我血刀刀法的滋味", 37, 0);
Talk("世上起有徒孫打贏祖師爺的道理，受死吧!", 120, 0);
if TryBattle(184) == false then
Dead();
exit();
end;
LightScene();
Talk("走吧，水姑娘，你的師哥跟你的父親因該都很掛念你", 37, 0);
Talk("狄大哥，謝謝你", 154, 0);
Talk("對了，兄弟，丁典兄弟生前希望能跟凌小姐合葬，我們去凌小姐的墓園前。", 37, 0);
Talk("的確，就替他完成這個愿望。", 0, 0);
AddMorality(5);
ModifyEvent(-2, -2, -2, -2, 1025, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(2, 6, 1, -2, 1198, -1, -1, 6086, 6086, 6086, -2, -2, -2);
ModifyEvent(45, 9, -2, -2, 1206, -2, -2, -2, -2, -2, -2, -2, -2);