if isUsingItem(191) == false then
exit();
end;
if InTeam(9) == false then
Talk("謝前輩，這是成崑的項上人頭．成崑作惡多端已遭天譴．", 0, 1);
Talk("你說是就是，想騙我這個瞎子嗎?", 13, 0);
exit();
end;
Talk("謝前輩，這是成崑的項上人頭．成崑作惡多端已遭天譴．", 0, 1);
Talk("沒錯，義父，我和大哥一起手刃成昆了", 9, 5);
Talk("是嗎？哈！哈！成崑啊，成崑！你作惡多端終遭天譴，但，可惜啊，可惜！我不能親手殺了你．　　　", 13, 0);
Talk("成崑一事已了，謝大俠還是盡快回到中土，明教上下都等著謝老爺子回去．", 0, 1);
Talk("少俠為我明教付出許多，謝某感激不盡．待我將這料里完畢後，定當趕回明教．到時還望少俠前來我明教作客．唉，成崑已死，這把屠龍刀我留著還有什麼用呢？屠龍刀就送給你好了．", 13, 0);
AddItem(117, 1);
if InTeam(28) == false then
exit();
end;
if HaveItemBool(109) == false then
exit();
end;
if InTeam(39) then
Talk("咱們自比方向著東南而來，現下該當向西北劃去才是，今天先在此地歇歇，明天應該就能回到中原了。", 9, 1);
Talk("謝老爺子，聽說武林之中，有些高人精通九陰真經，可有這件事嗎？", 122, 5);
Talk("故老相傳九陰真經神乎其技，武林上黑風雙剎就是修練九陰真經，雖然武功堪稱上等，但要到達一流的境界仍差的遠，不免令人懷疑九陰真經是否真的有傳說中的厲害。", 13, 0);
Talk("周姑娘，你峨嵋派有人會這門武功嗎？", 194, 1);
Talk("峨嵋派若有人具此神功，先師也不會喪身子萬安寺中了。", 122, 5);
Talk("好了，先休息吧!別再斗嘴了!明天還要提早起床上路呢。", 9, 1);
DarkScene();
Rest();
ModifyEvent(-2, -2, -2, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
LightScene();
Talk("奇怪，無忌兄弟，怎麼趙姑娘周姑娘還有謝前輩都不見了，干，我的倚天劍屠龍刀也都不見了。", 0, 0);
Talk("糟，我們昨天的飲用水被放入十香軟筋散，這個十香軟筋散就是趙姑娘在萬安寺對我們所用的迷藥，難道．．．", 9, 1);
Talk("你懷疑是趙敏?不可能拉，她這麼聰明的人，知道十香軟筋散對我們沒用，還會拿出來對我們下毒?", 0, 0);
Talk("不，她只要能迷昏周姑娘跟義父就夠了，沒想到她居然隱藏著如此惡毒的用心，看來全是為了得到倚天劍跟屠龍刀，不知周姑娘跟義父的性命是否無恙?", 9, 1);
Talk("我還是覺得怪怪的。", 0, 0);
Talk("母親曾經跟我說過，別相信漂亮的女人，真是一點都沒錯，趙敏啊趙敏，但教你撞在我手里，張無忌若再饒你，當真枉自為人了。", 9, 0);
AddItemWithoutHint(109, -1);
AddItemWithoutHint(117, -1);
SetRoleMagic(28, 0, 42, 900);
ModifyEvent(11, 90, 1, 1, 86, -1, -1, -2, -2, -2, -2, -2, -2);
LeaveTeam(28);
LeaveTeam(39);
exit();
end;
ModifyEvent(-2, 3, -2, -2, -1, -1, 67, -2, -2, -2, -2, -2, -2);
Talk("奇怪，我怎麼感覺頭昏昏的。", 0, 0);
PlayAnimation(-1, 5994, 6012);
DarkScene();
LightScene();
PlayAnimation(-1, 6026, 6036);
Talk("干，我怎麼躺在這里睡著了。", 0, 0);
Talk("哈哈哈，仁者無敵，居然是仁者無敵．", 122, 0);
Talk("周姑娘，你怎麼了?干，我的倚天劍跟屠龍刀怎麼斷了．", 0, 0);
Talk("你這兩把刀劍是我拿來互相撞擊才斷的，事已至此，後會有期。", 122, 0);
AddItemWithoutHint(109, -1);
AddItemWithoutHint(117, -1);
LeaveTeam(28);
if InTeam(9) == false then
Talk("搞屁啊，弄壞我這兩把寶刀寶劍就這樣走了，算了不跟他計較，誰叫他是正妹．", 0, 0);
ModifyEvent(11, 94, 1, 1, 109, -1, -1, 5294, 5294, 5294, -2, -2, -2);
exit();
end;
Talk("芷若 剛才弄暈我們的你吧，為啥你要弄暈我們，并將倚天劍屠龍刀用壞．", 9, 0);
Talk("無忌哥哥，師父臨終告訴我倚天劍屠龍刀藏著一個使人天下無敵的秘密，需要將倚天劍和屠龍刀互相撞擊才會知道，沒想到撞擊後兩把刀劍都斷了，卻出現了一張子條，上面寫者仁者無敵，仁者無敵，我費盡心機居然只得來這四個大字，哈哈哈，無忌哥哥，我沒有臉在跟你們在一起，我先走了．", 122, 0);
LeaveTeam(28);
Talk("芷若，芷若!", 9, 0);
LeaveTeam(9);
ModifyEvent(11, 94, 1, 1, 109, -1, -1, 5294, 5294, 5294, -2, -2, -2);