if InTeam(9) == false then
Talk("．．．．．．", 194, 0);
exit();
end;
Talk("明教教主今日駕臨寒舍，當真是蓬蓽生輝。張教主請！", 194, 0);
Talk("小姐，你怎地知道他就是張無忌？難道你有未卜先知的本領嗎？", 0, 1);
Talk("誰不知近日光明頂一戰，張教主以絕世神功威懾六大派，更是轟傳武林。各位東赴中原，一路上不知將有多少武林朋友仰慕接待，豈獨小女子為然？張教主的尊大人號稱『銀鉤鐵劃』，自是書法名家。張教主家學淵源，小女趙敏待會尚要求懇一幅法書。", 194, 0);
Talk("趙姑娘要我寫字，那可要了我的命啦。在下不幸，先父見背甚早，未克繼承先父之學，大是慚愧。", 9, 1);
Talk("各位遠道光降，敝莊諸多簡慢，尚請恕罪。各位路途勞頓，請到這邊先用些酒飯。這是紹興女貞陳酒，已有一十八年功力，各位請嘗嘗酒味如何？", 194, 0);
if InTeam(35) then
Talk("真是好酒!", 35, 1);
end;
if InTeam(50) then
Talk("趙姑娘大方獻出佳釀，喬某先乾為敬。", 50, 1);
end;
Talk("趙姑娘，承蒙厚待，敝教上下無不感激。在下有一句言語想要動問，只是不敢出口。", 9, 1);
Talk("張教主何必見外？我輩行走江湖，所謂『四海之內，皆兄弟也』，各位倘若不棄，便交交小妹這個朋友。有何吩咐垂詢，自當竭誠奉告。", 194, 0);
Talk("既是如此，在下想要請問，墻上所掛的劍可是倚天劍?姑娘這柄倚天劍從何處得來？", 9, 1);
Talk("張教主急忙欲知此劍來由不知是何緣故，可否見告？", 194, 0);
Talk("實不相瞞，此劍原為峨嵋掌門滅絕師太所有，敝教弟兄喪身在此劍之下者實不在少。在下自己，也曾被此劍穿胸而過，險喪性命，是以人人關注。", 9, 1);
Talk("張教主神功無敵，聽說曾以乾坤大挪移法從滅絕師太手中奪得此劍，何以反為此劍所傷？又聽說劍傷張教主者，乃是峨嵋派中一個青年女弟子，武功也只平平，小妹對此殊為不解。", 194, 0);
Talk("<她怎知道得這般清楚？>對方來得過於突兀，在下未及留神，至有失手。", 9, 1);
Talk("那位周芷若周姊姊定是太美麗了，是不是？", 194, 0);
Talk("姑娘取笑了。", 9, 1);
Talk("小妹不勝酒力，再飲恐有失儀，現下說話已不知輕重了。我進去換一件衣服，片刻即回，諸位請各自便，不必客氣。", 194, 0);
DarkScene();
ModifyEvent(-2, -2, -2, -2, -2, -2, -2, 5334, 5334, 5334, -2, -2, -2);
LightScene();
Talk("教主!", 10, 0);
Talk("你是范右使，你怎麼在這里?", 9, 1);
Talk("教主，這女子來歷大的很，我在他手底下臥底許久，終於有點頭緒，他就是蒙古國成吉思汗手下大將木華黎的女兒，并且查到六大派的人離開光明頂後都被她抓來這囚禁起來。", 10, 0);
Talk("什麼!居然囚禁了六大派，這不行，我應該馬上救六大派的人出來。", 9, 0);
Talk("教主神功無敵 救六大派的一定手到擒來 等下教主和我對打的話請裝做不認識我。", 10, 0);
DarkScene();
ModifyEvent(-2, -2, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
LightScene();
ModifyEvent(-2, 20, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 0, 1, -2, 595, -1, -1, 6756, 6756, 6756, -2, -2, -2);
ModifyEvent(-2, 1, 1, -2, 595, -1, -1, 6756, 6756, 6756, -2, -2, -2);