if HaveItemBool(78) == false then
exit();
end;
if InTeam(30) == false then
exit();
end;
if InTeam(35) == false then
exit();
end;
SubMapViewFromTo(31, 52, 14, 17);
SubMapViewFromTo(14, 17, 40, 17);
SubMapViewFromTo(40, 17, 31, 52);
Talk("奇怪，山洞里居然來了這麼多人。", 35, 0);
Talk("沖哥，你跟說過這里刻著五岳劍派失傳的劍法，這里的人，定是五岳劍派的人，不過那些人怎麼會知道這里呢?", 153, 4);
Talk("是了，當日嵩山大會上，小師妹的五岳劍派劍法就是從這學來，想當然師父也是知道，這里定是師父開放給五岳劍派的人看的，咱們進去看看。", 35, 0);
ModifyEvent(-2, -2, 0, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 1, 1, -2, 219, -2, -2, 5208, 5208, 5208, -2, -2, -2);
ModifyEvent(-2, 2, 1, -2, 219, -2, -2, 5208, 5208, 5208, -2, -2, -2);
ModifyEvent(-2, 3, 1, -2, 729, -2, -2, 5184, 5184, 5184, -2, -2, -2);
ModifyEvent(-2, 4, 1, -2, 728, -2, -2, 5190, 5190, 5190, -2, -2, -2);
ModifyEvent(-2, 7, 1, -2, 291, -2, -2, 5230, 5230, 5230, -2, -2, -2);
ModifyEvent(-2, 8, 1, -2, 730, -2, -2, 5200, 5200, 5200, -2, -2, -2);
ModifyEvent(-2, 9, 1, -2, 729, -2, -2, 5184, 5184, 5184, -2, -2, -2);
ModifyEvent(-2, 10, 1, -2, 731, -2, -2, 5174, 5174, 5174, -2, -2, -2);
ModifyEvent(-2, 11, 1, -2, 731, -2, -2, 5970, 5970, 5970, -2, -2, -2);
ModifyEvent(-2, 14, 1, -2, 728, -2, -2, 5190, 5190, 5190, -2, -2, -2);
ModifyEvent(-2, 15, 1, -2, 730, -2, -2, 5200, 5200, 5200, -2, -2, -2);