if InTeam(35) then
Talk("上面刻的萬花劍法，師尊從來沒有教過我們．", 83, 0);
Talk("你們怎麼會在這?", 35, 0);
Talk("回掌門師兄的話，是岳先生邀請五岳劍派來這，抄錄各派失傳的劍法．", 83, 0);
Talk("<果然是師父的主意，我師父招呼這些人來此，未必有什麼善意。我去告知派各，率領門人退出。那些劍招，出洞之后，讓我告知各派便了。>", 35, 0);
ModifyEvent(-2, 5, 0, -2, -2, -2, 732, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 6, -2, -2, -2, -2, -2, 5862, 5862, 5862, -2, -2, -2);
ModifyEvent(-2, 12, -2, -2, -2, -2, -2, 5946, 5946, 5946, -2, -2, -2);
ModifyEvent(-2, 13, -2, -2, -2, -2, -2, 6774, 6774, 6774, -2, -2, -2);
exit();
end;
Talk("上面刻的萬花劍法，師尊從來沒有教過我們．", 83, 0);