Talk("等等，快把鴛刀還給我!", 201, 5);
Talk("你就是把鴛刀放在那秀才身上的姑娘吧，我還正想說要怎麼找你，你卻自己找上門來，快把鴦刀交出來，省的我動手．", 0, 0);
Talk("看你剛才三言兩語唬走那個大內高手，瞧你武功也不怎樣，不把鴛刀拿來我就要搶了．", 201, 5);
Talk("好，我就他媽的看看誰搶誰的．", 0, 0);
if TryBattle(265) == false then
Dead();
exit();
end;
ModifyEvent(-2, 17, 1, -2, 745, -2, -2, 5102, 5102, 5102, -2, -2, -2);
LightScene();
Talk("哈哈哈，看來是我搶你．", 0, 0);
AddItem(188, 1);
Talk("你．．．你還算是男人嗎?用武力搶了女人的東西還這麼得意．", 201, 5);
ModifyEvent(-2, 18, -2, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 19, -2, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);