--function oldevent_699()
    instruct_52();   --  52(34):看道德
    runsql('update item set 仅修炼人物=-1 where 物品类型=2');

    --print(getrole(0, "生命"))
    --setrole(0, "生命", 995)
    --setrole(0, "名字", "闪避")

    math.randomseed(os.time());
    local n = getitemcountinbag(182);
    if (n>=2) then
    local k=math.modf(n-2);
    newtalk("你已勝"..k.."場。",300,0);
    array={219,79,1,2,58,166,220,226,23,27,39,40,41,48,49,87,203,222,96,61,62,64,65,8,25,29,43,69,70,208,97,3,16,18,44,52,53,59,76,77,132,145,157,158,159,178,179,180,181,182,204,209,99,30,31,32,35,36,45,50,51,85,102,141,151,164,46,78,101,103,212,215,63,88,104,201,4,7,33,37,42,82,94,105,136,144,156,160,167,190,205,211,225,98,163,89,106,66,0,10,20,21,34,75,84,92,107,135,137,143,149,150,161,168,169,171,206,224,108,9,11,12,47,109,162,192,110,221,111,24,26,28,60,67,93,100,112,113,138,146,172,173,174,188,193,197,198,213,216,71,72,114,115,202,194,14,19,116,147,148,117,5,15,38,55,68,86,91,118,139,142,152,155,165,175,189,191,195,210,119,120,121,90,122,73,95,123,140,153,199,207,124,125,17,126,127,13,22,56,128,154,176,177,187,196,200,214,217,218,223,129,130,131,6,74,81,183,54,57,83,133,134,170,184,186,185,80}
    local k = n + math.random(0, 10);
    if k < 1 then
        k = 1;
    end
    if k>#array then
        k = #array - 10 + math.random(0, 10);
    end
    if (trybattle(array[k], 0)) then
        local m = math.random(0,236)
        while getitem(m,"物品类型")==0 do
            m = math.random(0,236)
        end
        additem(m,1)
        additem(174, k);
        additemwithouthint(182, 1);
        additemwithouthint(209, math.random(0, 5));
        additemwithouthint(210, math.random(0, 5));
    else
        --additemwithouthint(199, 1);
    end
    autosave()
else
--function oldevent_691()
newtalk("哈哈哈哈哈！",300,0);   --  1(1):[???]說: 非常恭喜你！

newtalk("我靠吓我一跳！",0,1);   --  1(1):[WWW]說: 軟體娃娃！

instruct_27(1,6862,6888);   --  27(1B):顯示動畫
newtalk("这里是金庸群俠傳黑帝斯，可以瞎玩了！",300,0);   --  1(1):[???]說: 非常恭喜你，你是本産品消*費者中最幸運的一位．**軟體世界經過多年的努力研*究後，終于發展出一套完全*的ＶＲ游戲．*你將親身的扮演游戲的主人*翁，在我們爲你設計的游戲*世界中冒險．

newtalk("黑帝斯？不是哈迪斯嗎？",0,1);   --  1(1):[WWW]說: 你說什麽？*這不是在做夢吧？*”真正的ＶＲ游戲”？*不會吧？*你是說，你們已經可以像電*影，漫畫中的劇情一般，將*游戲設計的這麽”真實”？*讓玩者真的”身”處在游戲*世界中，而不是只能操縱鍵*盤，盯著螢幕看而已．

newtalk("這次作者比較裝逼，查了半天感覺哈迪斯是個錯誤翻譯，應該叫哈得斯才對。",300,0);   --  1(1):[???]說: 沒錯．*這是”最真實的游戲”！**而且你知道嗎，你是所有消*費者中最幸運的一位．*因爲基于成本考量，在衆多*的産品中，你購買的這套，*是我們所生産中僅有的一套*”ＶＲ”版．

newtalk("那你就叫哈得斯啊！",0,1);   --  1(1):[WWW]說: 哇塞！*好險我不是買”大補帖”．

newtalk("但是感覺黑帝斯這個名字比較霸道。",300,0);   --  1(1):[???]說: 是的．*唯有尊重智慧財産權的消費*者，才是最可愛的．*好了，接下來就要靠你自己*了．*祝你幸運．*因爲唯有完成本游戲，你才*能離開這個”游戲世界”，*回到現實的世界裏．．．．

newtalk("無聊的作者……那封面那個二貨是誰啊？",0,1);   --  1(1):[WWW]說: 等會等會．．．．*你不給我一點提示嗎？

newtalk("那個是中山靖王劉勝，人送綽號大舅哥的。",300,0);   --  1(1):[???]說: 難道你沒先看說明書嗎？

newtalk("啥？我不信他還會PS。",0,1);   --  1(1):[WWW]說: 抱歉！*我不習慣先看說明書的．

newtalk("那你還真說對了，圖是蘊殊小姐姐處理的。",300,0);   --  1(1):[???]說: 你們這些人都是這樣的，自*以爲厲害，都不看說明書．

newtalk("啊小姐姐！",0,1);   --  1(1):[WWW]說: 好啦，下次我一定會先看．*麻煩給點提示，比如說，這*游戲的目的是什麽？

newtalk("滾！",300,0);   --  1(1):[???]說: 這要留給你自己到游戲中去*找尋，現在不能告訴你．*不過．．．

newtalk("……好了，說點有用的。這次咋玩？",0,1);   --  1(1):[WWW]說: 不過什麽？

newtalk("這次是模仿爆款游戲黑帝斯的一個即時動作戰鬥系統。在戰鬥時，用wasd控制方向，ijkm表示裝備的4個武學。其中j是輕擊，威力較小，所有武功都能用。i爲重擊，會連續打出幾個攻擊，一般只適用于面攻擊。k爲遠程，一般只能用于綫攻擊。m爲閃身幷在路徑上多次攻擊。",300,0);   --  1(1):[???]說: 不過我還是給你一點提示．***游戲中有一個很重要的人，*你必須先找到他．**這個人懂的東西非常的多，*你找到他後，就可以明瞭到*游戲的大概及其目的了．*而且也唯有先找到他，游戲*中的許多場景才會打開，讓*你可以進入．*在此之前，你所能去的地方*只有客棧以及他家和這兒．*所以你得趕快找到他．

newtalk("就是說只能用4個武功？",0,1);   --  1(1):[WWW]說: 這個人是誰？

newtalk("沒錯，根據我們考證，你平常也就用一兩種武功。",300,0);   --  1(1):[???]說: 什麽都跟你說的話，游戲還*有樂趣嗎？

newtalk("劇情沒改？",0,1);   --  1(1):[WWW]說: 這．．

newtalk("你跑劇情也行，在我這裏打無限戰鬥也行。我會根據你現在的實力，給你安排對應難度的戰鬥。贏了你會隨機得到物品，打不過你就自己跑劇情叫隊友來幫忙。",300,0);   --  1(1):[???]說: 別擔心，游戲才剛開始，不*會太難的．**等會出了這裏後，到對面的*客棧打聽一下就有消息了．**不過可別忘了這游戲的背景*是古代，所以注意一下你的*言談舉止．*對了，忘記告訴你，本游戲*是采”有死亡”的設計，*所以．．願主保佑你！

newtalk("感覺作者很懶。",0,1);   --  1(1):[WWW]說: 我最怕的就是這樣了！*都什麽年頭了，還設計這種*”死亡制”的游戲．*你們喜歡復古啊！

newtalk("恭喜你答對了！（考慮滅口）",300,0);   --  1(1):[???]說: 別怕，這房內爲你準備了一*些基本物品，都放在各種箱*子中．*這其中有些藥丸，在你生命*垂危時可以派上用場的．**另外，你身上好像有些東西*是從現代帶過來的，也可以*派上用場．*而且看你的資料，似乎也會*一點拳法，沒問題的．

newtalk("發現游戲不合理咋辦？",0,1);   --  1(1):[WWW]說: 什麽拳法，*我只會”野球拳”！

newtalk("不合理很正常，可以到這項個目的地址：https://github.com/scarsty/kys-cpp，或者論壇https://tiexuedanxin.net/反饋。",300,0);   --  1(1):[???]說: 好了，不能再說下去了，游*戲設計者叮嚀過我，話不能*說太多，否則會犯了游戲的*大忌，俗語說．．．．．．*”好ＧＡＭＥ不多話”．**ＢＹＥ！ＢＹＥ！
newtalk("另外你記得戰鬥前裝備武功！",300,0); 
additemwithouthint(182, 1);
additem(112,1);
additem(134,1);
additem(166,1);
additem(186,1);
end
