Talk("全真的武學，講求循序漸進", 68, 0);
x[10] = 126;
do
{
    if (x[10] > 144)
    {
        Talk("全真的武學，講求循序漸進", 68, 0);
        exit();
    }
x[1] = GetRole(0, x[10] / 2);
jump_flag = (x[1] == 31);
x[10] = x[10] + 2;
} while (!jump_flag);
x[10] = x[10] + 18;
x[30] = GetRole(0, x[10] / 2);
if (!(x[30] >= 600))
{
    Talk("全真的武學，講求循序漸進", 68, 0);
    exit();
}
Talk("你于武學上的造詣確實不錯今天為師就來考教一下你現在的武學修為．你準備好了嗎？", 68, 0);
if (!AskBattle())
{
    Talk("我先去準備一下，做做熱身運動．", 0, 0);
    ModifyEvent(-2, -2, -2, -2, 1117, -2, -2, -2, -2, -2, -2, -2, -2);
    exit();
}
if (!TryBattle(228))
{
    LightScene();
    Talk("你還要繼續修煉，感覺可以了，再來找我．", 68, 0);
    ModifyEvent(-2, -2, -2, -2, 1117, -2, -2, -2, -2, -2, -2, -2, -2);
    exit();
}
LightScene();
Talk("你的武功非常的不錯．", 68, 0);
AddItem(185, 1);
ModifyEvent(-2, -2, -2, -2, 1118, -2, -2, -2, -2, -2, -2, -2, -2);
