x[10] = 126;
do
{
    if (x[10] > 144)
    {
        Talk("星宿老仙，法力無邊．", 92, 0);
        exit();
    }
x[1] = GetRole(0, x[10] / 2);
jump_flag = (x[1] == 5);
x[10] = x[10] + 2;
} while (!jump_flag);
x[10] = x[10] + 18;
x[30] = GetRole(0, x[10] / 2);
if (!(x[30] >= 600))
{
    Talk("．．．．．．", 92, 0);
    Talk("做什么，愁眉苦臉的？", 0, 1);
    Talk("唉！可惜你現在幫不了我．", 92, 0);
    exit();
}
Talk("．．．．．．", 92, 0);
Talk("做什么，愁眉苦臉的？", 0, 1);
Talk("噓！！", 92, 0);
Talk("什么事大驚小怪的？", 0, 1);
Talk("我發現阿紫偷了老仙的神木王鼎，向西夏方向去了，但沒及時通知老仙，現在怕老仙殺我啊．", 92, 0);
Talk("什么？星宿的寶貝神木王鼎被阿紫偷走了？", 0, 1);
Talk("啊？你還不知道？糟了，我真是個大嘴巴，這要是被老仙知道了，我一定沒命了．", 92, 0);
Talk("你放心，我不會說出去的．", 0, 1);
Talk("那就好！！！！！！", 92, 0);
ZeroAllMP();
SetRole(0, 42 / 2, 30);
x[1] = GetRole(0, 40 / 2);
x[1] = x[1] + 50;
SetRole(0, 40 / 2, x[1]);
Talk("啊！你竟然用毒藥！", 0, 1);
Talk("只有死人才能不說出去．", 92, 0);
if (!TryBattle(183))
{
    Dead();
    exit();
}
ModifyEvent(-2, -2, 0, -2, 0, 0, 0, 0, 0, 0, 0, -2, -2);
LightScene();
Talk("神木王鼎？阿紫？會在哪呢找到交給老仙一定會有賞．", 0, 1);
ModifyEvent(9, 9, 0, -2, 0, 0, 914, 0, 0, 0, 0, -2, -2);
ModifyEvent(9, 10, 0, -2, 0, 0, 914, 0, 0, 0, 0, -2, -2);
ModifyEvent(9, 11, 1, -2, 0, 0, 0, 6374, 6374, 6374, 0, -2, -2);
ModifyEvent(9, 12, 1, -2, 0, 0, 0, 6368, 6368, 6368, 0, -2, -2);
ModifyEvent(9, 13, 1, -2, 0, 0, 0, 6366, 6366, 6366, 0, -2, -2);
ModifyEvent(9, 14, 1, -2, 0, 0, 0, 6370, 6370, 6370, 0, -2, -2);
ModifyEvent(9, 15, 1, -2, 0, 0, 0, 6372, 6372, 6372, 0, -2, -2);
AddMorality(-2);
