ModifyEvent(-2, -2, -2, -2, 756, -2, -2, -2, -2, -2, 0, -2, -2);
instruct_50e(19, 0, 0, 0, 0, 0, 0);
instruct_50e(3, 0, 1, 0, 0, 420, 0);
if InTeam(2) then goto label30 end;
Talk("書生：曹操不羅嗦，一心要那荊州，用明爭，暗奪，淡薄……", 0, 2);
exit();
::label30::
Talk("書生：這不是趙將軍嗎？前幾天長??坡多虧你相救，不然我的私房錢就要給山賊搶光了", 0, 2);
Talk("最近我沒回長??坡啊", 2, 0);
instruct_50e(32, 0, 0, 2, 0, 0, 0);
Talk("我以人格保證，這幾天我們一直在東吳考察", 0, 0);
Talk("書生：不會的，明明一模一樣，我不會看錯的", 0, 2);
instruct_50e(32, 0, 0, 2, 0, 0, 0);
Talk("去長板坡看看吧", 0, 0);
ModifyEvent(-2, -2, -2, -2, 756, -2, -2, -2, -2, -2, 0, -2, -2);
ModifyEvent(41, 21, 1, -2, 757, -2, -1, 9332, 9332, 9332, 0, -2, -2);