if InTeam(12) == true then goto label0 end;
    ModifyEvent(-2, -2, -2, -2, -1, -2, -1, -2, -2, -2, 0, -2, -2);
exit();
::label0::
    instruct_50e(19, 0, 0, 0, 0, 0, 0);
    instruct_50e(3, 0, 1, 0, 0, 420, 0);
    DarkScene();
    LightScene();
    Talk("（其實偶爾做做夜盲俠或者蜘蛛俠，感覺蠻好的）", 12, 0);
    instruct_50e(32, 0, 0, 2, 0, 0, 0);
    Talk("不走了，一路上打呀殺的，俺老張的矛都快鈍了。不走了。俺要喝酒，俺要喝酒", 0, 0);
    Talk("張將軍，我們現在是逃亡，不是公務出差，也不是旅游觀光。逃命要緊，還是忍忍吧，逃過這一劫，我請你喝人頭馬！", 12, 0);
    instruct_50e(32, 0, 0, 2, 0, 0, 0);
    Talk("老板：賣酒咯！！", 0, 0);
    Talk("（聽你唱歌，慘過被追殺）這里一定是酒鋪，還是喝酒吧", 12, 0);
    ModifyEvent(-2, -2, -2, -2, -1, -2, -1, -2, -2, -2, 0, -2, -2);
    ModifyEvent(-2, 33, -2, -2, 840, -2, -1, -2, -2, -2, 0, -2, -2);
exit();
