instruct_50e(19, 0, 0, 0, 0, 0, 0);
instruct_50e(3, 0, 1, 0, 0, 420, 0);
if HaveItemBool(121) == true then goto label0 end;
    Talk("好危險，這到底是藏寶洞還是練功場！不過這個象牙看起來不錯的樣子", 0, 2);
exit();
::label0::
    Talk("居民：作為一個專業的象牙雕刻師，象牙好不好我一看就知道", 0, 2);
    instruct_50e(32, 0, 0, 2, 0, 0, 0);
    Talk("居民：光有象牙是沒有用的。除非再有我手上這顆虹水晶", 0, 0);
    Talk("居民：你居然打到這么好的象牙", 0, 2);
    instruct_50e(32, 0, 0, 2, 0, 0, 0);
    Talk("九死一生，如果不好我就關機了", 0, 0);
    Talk("你不會白白給我的，什么條件說吧", 0, 2);
    instruct_50e(32, 0, 0, 2, 0, 0, 0);
    Talk("居民：大過年的，我不會為難你的，直接送給你吧", 0, 0);
    ModifyEvent(-2, -2, -2, -2, 958, -2, -2, -2, -2, -2, 0, -2, -2);
    AddItem(120, 1);
exit();
