--function oldevent_692()
    --instruct_51();   --  51(33):问软体娃娃
    --newtalk("這是黑帝斯，封面模特是中山靖王劉勝。",114,0);
    --newtalk("在戰鬥時，用wasd控制方向，ijkm表示裝備的4個武學。其中j是輕擊，威力較小，所有武功都能用。i為重擊，會連續打出幾個攻擊，一般只適用於面攻擊。k為遠程，一般只能用於綫攻擊。m為閃身并在路徑上多次攻擊。",114,0);
    newtalk("你已勝"..getitemcountinbag(198).."場，負"..getitemcountinbag(199).."場。",114,0);
    array={54,57,133,134,131,130,129,22,128,127,126,125,124,56,123,90,122,12,77,121,120,119,13,15,55,118,117,83,116,115,74,71,114,67,68,76,81,93,112,113,111,86,110,100,47,109,108,6,84,95,107,135,66,72,89,106,75,98,11,20,33,37,105,88,104,63,46,78,80,82,101,103,94,4,5,9,24,26,28,30,31,32,34,35,36,45,50,51,85,92,102,53,99,10,14,16,18,19,38,44,79,132,97,73,8,21,43,60,69,70,91,61,62,64,65,96,1,17,23,25,27,29,39,40,41,49,59,87,0,2,3,42,58,7,48,52};
    local n = getitemcountinbag(198);
    local k = 133 - n / 2 + math.random(-3, 3);
    if k < 1 then
        k = math.random(1,133);
    end
    k=math.floor(k)
    --print(k, array[k])
    if (trybattle(array[k], 0)) then
        additem(math.random(0,197),1);
        additemwithouthint(198, 1);
    else
        additemwithouthint(199, 1);
    end
    autosave()
--end

