if isUsingItem(195) == false then
exit();
end;
Talk("嘿嘿嘿嘿（向言達平的尸身踢了一腳，拔出他背上的長劍，又在他背心上連刺數劍。）二師哥，你也查到了連城劍譜中的秘密，是不是？嘿嘿！‘江陵城南偏西，天寧寺大殿佛像，向之虔誠膜拜，通靈祝告’哈哈，二師哥，劍譜中說：‘如來賜福，往生極樂’，你現下不是往生極樂了么？這不是如來賜福了么？你奶奶的臭佛，戲弄了老子一生，坑害得我可就苦了！（縱身上了神壇，在佛像腹上連砍三劍。）", 0, 0);
Talk("！！！！！！！！！！！！（師父殺害自己的同門師兄手段竟如此狠毒殘忍，）", 0, 0);
Talk("大金佛！都是黃金！！都是黃金！！！啊~~~（給人點中了穴道摔倒在地。）", 266, 1);
Talk("戚師弟，你找得到這兒，老二找得到這兒，怎么不想想，大師兄也找得到這里啊！", 0, 0);
Talk("哼 第一次你整我不死，想不到終于還是要死在你的手下。", 266, 1);
Talk("我正在奇怪，戚師弟，我扼死了你，將你封入夾墻之中，怎么又會活了過來？", 0, 0);
Talk("你不回答，難道我就猜不到？那時你敵我不過，就即閉氣裝死，被我封入了夾墻之后，居然能夠脫逃。了不起！好本事！當時我見封墻的磚頭有一塊凸了出來，心中一直覺得不大妥當，可說什么也想不到是給你掙扎著逃走時踢出來的。嘿嘿，你也真厲害，眼睜睜地瞧你女兒做了我兒媳婦，竟始終不現身。", 266, 1);
Talk("哼 我女兒偷了我劍譜，藏在山洞之中，你道她是什么好人？我一直在暗中查察。姓萬的你給我個痛痛快快吧！", 0, 0);
Talk("好，給你個痛快的。按理說，不能給你這么便宜只是你師哥沒工夫了，須得趕快用爛泥涂好佛像。好師弟，你乖乖的上路罷！", 0, 0);