if InTeam(73) then
Talk("鳳凰，我們要上黑木崖決戰了。你也來幫忙吧。", 73, 1);
Talk("是，我聽圣姑的。", 25, 0);
if HaveItemBool(171) then
Talk("咦 少俠你的蛇兒怎么養的那么好。看這額頭上的白色鱗片還有這充滿靈氣的眼神..我好喜歡哦 能不能送給奴家。", 25, 0);
Talk("不行小青是我的伙伴", 0, 5);
Talk("嘶嘶....嘶嘶.....", 94, 1);
Talk("呵呵呵 小家伙還挺逗的讓他跟著你這種什么都不懂的主人太可惜了。我教你些高級的的馭蛇法吧。", 25, 0);
AddSpeed(94, 30);
AddMaxMP(94, 700);
SetRoleMagic(94, 0, 150, 900);
end;
DarkScene();
ModifyEvent(37, 5, 0, 5, 0, 0, 0, 0, 0, 0, -2, -2, -2);
LightScene();
Join(25);
exit();
end;
Talk("藍教主可愿和在下一起闖蕩江湖？", 143, 1);
Talk("我是日月神教的屬下，我要聽圣姑的。", 25, 0);