if InTeam(1) == false then
Talk("那位小兄弟....一定是......不過......怎么可能！？", 3, 0);
exit();
end;
Talk("你準備好了嗎？", 3, 0);
if AskBattle() == false then
exit();
end;
if TryBattle(4) == false then
Talk("和胡一刀差太遠了，再去好好琢磨琢磨。", 3, 0);
exit();
end;
LightScene();
Talk("不錯，你有這樣的武藝，你爹也可放心了。來，把我殺了，替你爹報仇。", 3, 0);
Talk("........................", 1, 5);
Talk("........................", 3, 0);
Talk("兄弟，我們走吧。仇我已經報了。", 1, 5);
Talk("對嘛！這才是我的好大哥。", 247, 1);
Talk("這個給你。這是你爹當年留下來的一幅藏寶圖，理應交給他的后人。這本書也拿去吧，希望能幫小兄弟解決困難。", 3, 0);
AddItem(225, 1);
AddItem(144, 1);
Talk("呀呼！找到”飛狐外傳”了多謝苗大俠。", 247, 1);
DarkScene();
ModifyEvent(0, 6, 1, 6, 16, 0, 0, 6860, 6860, 6860, -2, -2, -2);
ModifyEvent(24, 8, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
LightScene();