SubMapViewFromTo(19, 11, 11, 11);
Talk("朝廷重地，閑人回避！", 208, 0);
if TryBattle(142) == false then
Dead();
exit();
end;
ModifyEvent(110, 15, 0, 15, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(110, 16, 0, 16, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(110, 13, 0, 13, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(110, 6, 1, 6, 237, 0, 0, 7026, 7026, 7026, -2, -2, -2);
ModifyEvent(110, 4, 1, 4, 0, 0, 0, 8254, 8254, 8254, -2, -2, -2);
ModifyEvent(110, 5, 1, 5, 0, 0, 0, 8254, 8254, 8254, -2, -2, -2);
LightScene();
Talk("張大人，不好了，那要犯被人救走了。", 144, 0);
Talk("什么？好啊，原來你是在跟我使穩君計！", 80, 0);
Talk("你才知道啊，晚嘍。拜拜了。", 0, 1);
Talk("........這小子身法很眼熟好像在哪里見過。", 80, 0);