Talk("楊兄，龍姑娘，一切可好，龍姑娘傷勢如何了？", 0, 1);
Talk("已經不礙事事了，多謝少俠關心", 59, 0);
Talk("我夫婦得少俠多次多次相救，深感大恩，若少俠有需要之處，我夫婦自當盡力幫忙。", 58, 0);
if AskJoin () == false then
exit();
end;
Talk("近日旅途有些不順，如能得楊兄和龍姑娘相助，真是再好不過了。", 247, 1);
Talk("既然如此，我們就直接去小村了。", 58, 0);
DarkScene();
ModifyEvent(104, 68, 1, 0, 969, 0, 0, 6186, 6186, 6186, -2, -2, -2);
ModifyEvent(104, 76, 1, 0, 970, 0, 0, 7242, 7242, 7242, -2, -2, -2);
ModifyEvent(-2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(70, 19, 1, 0, 151, 0, 0, 6188, 6188, 6188, -2, -2, -2);
ModifyEvent(70, 20, 1, 0, 153, 0, 0, 6068, 6068, 6068, -2, -2, -2);
AddMorality(2);
LightScene();