if HaveItemBool(47) == false then
Talk("可蘭經找到了嗎？？", 320, 0);
exit();
end;
LightScene();
Talk("霍姑娘   不負所望。", 0, 5);
Talk("奉至仁慈的阿拉之名，一切贊頌，全歸阿拉，全世界的主，至仁至慈的主報應日的君主。我們只崇拜你，只求你佑助求你引導我們上正路，你所佑助者的路，不是受譴責者的路，也不是迷誤者的路。", 320, 0);
Talk("........................", 0, 5);
Talk("多謝少俠，你將敝族圣物從奸人手中奪回。以后但有所使，只要傳一信來，雖是千山萬水，亦必趕到，赴湯蹈火，在所不辭。", 320, 0);
Talk("霍姑娘客氣了  呵呵...........", 0, 5);
DarkScene();
ModifyEvent(17, 0, 0, 0, -1, 0, 0, -1, -1, -1, -2, -2, -2);
ModifyEvent(17, 33, 1, 33, 234, 0, 0, 4624, 4624, 4624, -2, -2, -2);
LightScene();