SubMapViewFromTo(46, 44, 43, 27);
Talk("皇上 本來君要臣死臣不得不死，不過皇上這樣對鰲拜，鰲拜絕不甘心。", 163, 5);
Talk("大膽鰲拜朕..............朕知你武功蓋世，本想試試你身手，你......你竟然口出大逆不道之言。", 323, 4);
Talk("（要不要等鰲拜殺了皇帝，滿清韃子就讓他們亂吧）", 0, 1);
Talk("什么人！", 163, 5);
Talk("靠 被發現了  那只好上了", 0, 1);
if TryBattle(97) == false then
end;
OldSetScenePosition(45, 32);
LightScene();
Talk("我擦 居然還穿了金絲甲。好硬破不了防。", 0, 5);
ModifyEvent(111, 2, 0, 2, 0, 0, 0, 7398, 7398, 7398, -2, -2, -2);
Talk("原來是北辰兄 ，皇上壽與天齊，鳥生魚湯，我們有救了。", 115, 0);
Talk("對對，少俠只要殺死鰲拜，朕重重有賞。", 323, 4);
if TryBattle(97) == false then
end;
LightScene();
Talk("二人打的誰也奈何不了誰。突然鰲拜開始攻擊康熙和偉小寶。", 0, 3);
DarkScene();
ModifyEvent(111, 1, 0, 1, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(111, 2, 0, 2, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(111, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(111, 10, 0, 10, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(111, 11, 0, 11, 0, 0, -1, 0, 0, 0, -2, -2, -2);
LightScene();
Talk("救命啊~~~~~~ 鰲拜造反啦來人啊~~~~~~~人都死到哪里去啦。救命啊著火啦~~~~~~~快救點出來救火火。", 115, 0);
ModifyEvent(112, 48, 0, 48, 0, 0, 23, -2, -2, -2, -2, -2, -2);