AddMorality(-1);
Add3EventNum(61, 19, 1, 0, $5);
Add3EventNum(61, 18, 1, 0, $5);
Talk("貝大夫為何愁眉苦臉？", 0, 1);
Talk("幫主不見了，二使已經來過了，唉", 85, 0);
Talk("莫非貝大夫接下了賞善罰惡令？", 0, 1);
Talk("不接馬上就要死，還是接了吧。", 85, 0);
Talk("如果我替你去赴這俠客島之約，你以為如何？", 0, 1);
Talk("少俠若愿意為我擋災，貝海石愿效犬馬之勞，今后愿聽少俠差遣。", 85, 0);
Talk("哈哈哈，好！", 0, 1);
AddItem(198, 1);
ModifyEvent(74, 0, -2, 0, -2, 427, 0, -2, -2, -2, -2, -2, -2);
if AskJoin () == false then
ModifyEvent(-2, -2, 1, 0, 426, 0, 0, -2, -2, -2, -2, -2, -2);
exit();
end;
if TeamIsFull() == false then
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
Join(85);
exit();
end;
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(70, 47, 1, 0, 185, 0, 0, 7028, 7028, 7028, -2, -2, -2);