Talk("少俠且慢 不知少俠剛才在街上和那賣藥老頭交換什么東西，那老頭一直都笑那么開心。", 0, 3);
Talk("哦 我剛才用一枚暗器和他交換東西，聽說這暗器挺珍貴的。", 0, 0);
Talk("什么暗器 ！？少俠還有嗎？ 可否讓我瞧瞧。", 0, 3);
if HaveItemBool(191) == false then
Talk("我只有一個，已經沒了。", 0, 0);
Talk("那實在是太可惜了。", 0, 3);
ModifyEvent(115, 4, 1, 4, -1, -2, -2, -2, -2, -2, -2, -2, -2);
exit();
end;
Talk("就是這個，好像叫做天女散花鏢。", 0, 0);
Talk("恩 很精巧的玩意。上面的符文很有價值。好像是古戰國時期的。我愿意出一千兩買下，少俠可否割愛。", 0, 3);
Talk("沒問題 （這東西還真是寶貝啊）", 0, 0);
AddItem(174, 1000);
AddItemWithoutHint(191, -1);
Talk("不知少俠是從那里得到的。要是能知道，是怎么制造的就好了。", 0, 3);
if HaveItemBool(223) == false then
Talk("這是我碰巧在一個湖底撿到的，當時也只撿到了三個。", 0, 0);
Talk("唉~~~~~~~這種技藝失傳了還真是可惜啊。", 0, 3);
ModifyEvent(0, 4, 1, 4, -1, -2, -2, -2, -2, -2, -2, -2, -2);
exit();
end;
Talk("這本秘笈里好像有制作方法", 0, 0);
Talk("什么！！！！！！（驚訝）我看看....（驚喜）果然有少俠請稍等一下。", 0, 3);
DarkScene();
ModifyEvent(115, 5, 0, 5, -2, -2, -2, -1, -1, -1, -2, -2, -2);
ModifyEvent(115, 4, 1, 4, -1, -2, -2, -2, -2, -2, -2, -2, -2);
LightScene();
Talk("（激動地從內門出來）少俠請進，我們的打鐵師傅想見見你。", 0, 3);
Talk("........................", 0, 0);