Talk("這位大爺 我想買你那瓶五寶花蜜酒。", 0, 0);
Talk("小兄弟真識貨，三百兩銀子賣你。", 201, 1);
if HaveItemBool(191) == false then
if CheckEnoughMoney(300) == false then
Talk("少俠好像銀子不夠啊。", 201, 1);
exit();
end;
AddItem(174, -300);
AddItem(25, 1);
ModifyEvent(115, 47, 1, 47, -1, -2, -2, -2, -2, -2, -2, -2, -2);
exit();
end;
Talk("北辰月拿錢時懷里的暗器袋掉了出來。", 0, 2);
Talk("這是！！！！！！！失傳的天女散花鏢。", 201, 1);
Talk("？？這東西很值錢嗎。我用一個這暗器換你的酒如何。", 0, 0);
Talk("當然可以 不過這樣的話老夫就占小兄弟大便宜了。這樣把，除了酒之外。我這個攤子上的東西，你看看喜歡的就挑一樣吧。", 201, 1);
Talk("哦 那我就不客氣了 （那東西那么珍貴嗎 看來有空還要回古墓湖底看看）", 0, 0);
AddItem(25, 1);
AddItemWithoutHint(191, -1);
ModifyEvent(115, 45, 1, 45, 432, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(115, 46, 0, 46, 433, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(115, 47, 1, 47, -1, -2, -2, -2, -2, -2, -2, -2, -2);