if InTeam(55) == false then
Talk("........................", 304, 0);
exit();
end;
Talk("郭靖 郭靖 你終于回來了~~~~(>_<)~~~~ 嗚...嗚...", 304, 4);
Talk("怎么了？？華箏  別哭了", 55, 5);
Talk("那個都史在打獵的時候搶了托雷的獵物，還打傷了托雷。我爹居然沒說什么還......還要把我許配給那個都史", 304, 4);
Talk("什么！！！！！！！！！！大漢怎么能這樣。我去找他。", 55, 5);
Talk("郭靖........", 304, 4);
DarkScene();
LeaveTeam(55);
ModifyEvent(138, 15, 0, 15, -1, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(137, 20, 0, 20, 0, 0, 450, 0, 0, 0, -2, -2, -2);
ModifyEvent(137, 16, 1, 16, 0, 0, 0, 6156, 6156, 6156, -2, -2, -2);
ModifyEvent(137, 19, 1, 19, 0, 0, 0, 6870, 6870, 6870, -2, -2, -2);
LightScene();