Talk("這不是諸葛先生嗎，生意越做越好啦。都做到襄陽城來了。", 0, 5);
Talk("小恩公是你啊，唉......生意是越做越火。可只是造福了少部分人。", 297, 0);
Talk("？？？？", 0, 5);
Talk("店里很多伙計大部分不是非常愚蠢的傻干活，就是耍小聰明偷懶。教他們經營方法，都不愿意學。唉............", 297, 0);
ModifyEvent(126, 27, 1, 0, -1, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(126, 3, 1, 3, 1217, 0, 0, 5410, 5410, 5410, -2, -2, -2);
ModifyEvent(126, 2, 1, 2, 1218, 0, 0, 5408, 5408, 5408, -2, -2, -2);
ModifyEvent(126, 0, 1, 0, 1219, 0, 0, 5406, 5406, 5406, -2, -2, -2);
ModifyEvent(126, 1, 1, 1, 1220, 0, 0, 5404, 5404, 5404, -2, -2, -2);