Talk("小子，你擅闖鐵掌山，是何用意？", 67, 0);
Talk("晚輩經過這鐵掌山下，看到此山形狀奇特，特地上山來看一看。那知你的手下就動手打人，難道此山是你們的嗎？", 143, 5);
Talk("不知天高地厚的小子。你知道江湖上武功最高的是誰嗎？", 67, 0);
Talk("我曾聽人說，東邪，西毒，南帝，北丐，是江湖上武功最高強的四人", 143, 5);
Talk("當年華山論劍之時，要不是我的鐵掌神功還沒練成，來不及參加 否則，“武功天下第一”的名號豈會被王重陽奪去。如今我神功既成，下一回的華山論劍，我會讓世人知道誰才是當今江湖中武功最高的人。", 67, 0);
Talk("是嗎？可是我也會參加此次的大會，這武功天下第一的封號我也想要耶。", 143, 5);
Talk("現在的年輕人都像你一樣狂妄嗎？今天，我就讓你嚐嚐苦頭。", 67, 0);
if TryBattle(71) == false then
Dead();
exit();
end;
LightScene();
Talk("老伯，我看下一次的華山論劍，你還是別參加了，繼續再苦練吧。", 143, 5);
Talk("........................", 67, 0);
ModifyEvent(-2, -2, 1, 0, 470, 0, 0, -2, -2, -2, -2, -2, -2);
ModifyEvent(52, 5, 0, 5, 0, 0, 0, 5332, 5332, 5332, -2, -2, -2);
ModifyEvent(52, 24, 1, 24, 0, 0, 0, 6602, 6602, 6602, -2, -2, -2);
ModifyEvent(52, 25, 1, 25, 529, 0, 0, 6314, 6314, 6314, -2, -2, -2);