Talk("一燈大師、黃島主、洪幫主、各位道長，晚輩有禮了", 0, 1);
Talk("你來啦。我知道你要找《射雕英雄傳》一書，而此書就在重陽宮中。", 65, 0);
Talk("啊？", 0, 1);
Talk("既然你已經改邪歸正，此書本當送你。", 69, 0);
Talk("不過在贈送之前，我們還要考教考教你的武功。", 57, 0);
Talk("你準備好了嗎？", 65, 0);
if AskBattle() then
Talk("有架打，怎能少的了我！", 64, 0);
if TryBattle(186) == false then
LightScene();
Talk("看來少俠還需努力一番才是", 65, 0);
exit();
end;
LightScene();
Talk("少俠武功高強，佩服佩服。望少俠今后能走在正途。", 65, 0);
AddItem(148, 1);
Add3EventNum(61, 0, 1, 0, 0);
Add3EventNum(61, 8, 1, 0, 0);
Add3EventNum(61, 17, 1, 0, 0);
Add3EventNum(61, 16, 1, 0, 0);
ModifyEvent(-2, 0, 1, 0, 499, 0, 0, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(-2, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
ModifyEvent(23, 0, 1, 0, 487, 0, 0, 6122, 6122, 6122, -2, -2, -2);
exit();
end;