if isUsingItem(196) == false then
exit();
end;
AddItemWithoutHint(196, -1);
Talk("慕容公子，你要找的大燕國傳國玉璽在這里。", 0, 1);
Talk("真的找到了！有了它，我大燕復國有望。", 51, 0);
Talk("那慕容公子可否履行諾言，告知在下《天龍八部》一書的下落。", 0, 1);
Talk("等會，有了傳國玉璽并不能證明我慕容復的身份，那麼別人就不會聽我號召……大燕皇帝世系譜表呢？大燕皇帝世系譜表呢？", 51, 0);
Talk("慕容公子并未叫我找那什麼大燕皇帝世系譜表啊！", 0, 1);
Talk("沒有大燕皇帝世系譜表，別人怎會相信我慕容復是王孫的後代。你快去找大燕皇帝世系譜表，找到了我才跟你說《天龍八部》的下落。", 51, 0);
Talk("表哥，做人怎可言而無信，你說好要告訴這位公子的，怎可反悔。你不說，我可要告訴他了。", 76, 0);
Talk("你敢！", 51, 0);
Talk("……（疑惑的眼神望過來）", 76, 0);
Talk("好，我就再信你一次，去幫你找那什麼世系譜表。希望到時慕容公子別再失信。", 0, 1);
Talk("記得，若你想知道《天龍八部》的下落，就快去找大燕皇帝世系譜表。", 51, 0);
ModifyEvent(-2, -2, 1, 0, 546, 547, 0, -2, -2, -2, -2, -2, -2);