if CheckRoleAttack(0, 265, 999) then
Talk("哈啊~~~~~~~", 0, 5);
DarkScene();
SetRoleMagic(0, 4, 122, 100);
LightScene();
Talk("！！！！！！！！！！！！（那把無形之劍是......）", 145, 0);
if TryBattle(271) == false then
LightScene();
Talk("糟糕 一時沒收住手", 145, 0);
Dead();
exit();
end;
SetRoleMagic(0, 4, 0, 0);
LightScene();
Talk("剛才怎么回事 那把劍怎么出現的。", 145, 0);
Talk("？？？我也不知道怎么回事剛才這把劍好像在呼喚我體內的什么東西。然后就不知不覺的使出來了", 0, 5);
Talk("你在試試看 能不能再使出來。", 145, 0);
PlayMusic(28);
Talk("........................", 0, 5);
Talk("........................", 145, 0);
Talk("........................", 0, 5);
Talk("........................", 0, 5);
Talk("........................", 0, 5);
Talk("使換不出來，剛才那種感覺沒了。", 0, 5);
Talk("那我們再交手試試，也許等你可以用那把重劍使出劍法時就可以了。", 145, 0);
Talk("恩...........（哈哈哈哈原來我也有外掛）", 0, 5);
ModifyEvent(101, 1, 1, 1, 1168, -2, -2, -2, -2, -2, -2, -2, -2);
exit();
end;
Talk("老前輩 得罪了", 0, 5);
Talk("放馬過來吧。", 145, 0);
if TryBattle(271) == false then
LightScene();
Talk("不行啊   劍不是這么使的。再試試看。", 145, 0);
exit();
end;
LightScene();
Talk("好 再來", 145, 0);