if CheckRoleAttack(0, 180, 999) then
Talk("承讓 承讓 林家的辟邪劍法果然與眾不同。（北辰月假裝打成平手）", 0, 0);
Talk("呼~呼~呼~呼~呼少俠的劍法也不錯。", 36, 1);
Talk("彼此彼此（靠 這樣打下去，什么時候是個頭啊）", 0, 0);
Talk("小聲說：北辰大哥你的掌法不是更厲害嗎，干嘛和他比劍啊。還假裝平手。我看那套劍法爛的可以了。沒想到你那套劍法更爛。", 77, 5);
Talk("小聲說：你不覺得耍劍比較帥嗎。", 0, 0);
Talk("........................", 77, 5);
Talk("少鏢頭驛站的趙老板說貨都到齊了要你去查點一下。", 208, 5);
Talk("林兄弟既然有事，我們就告辭了。（還是趁早離開的好）", 0, 0);
Talk("哦 些許小事而已，少俠如果沒什么急事的話。不如暫住幾天。由我做東到福州游玩如何。", 36, 1);
Talk("這個..................（快被滅門了還想著游玩）", 0, 0);
Talk("好啊 好啊 好啊  我沒問題", 77, 5);
Talk("同意 同意 趕路都累死了。", 115, 5);
Talk("恩.....那就打擾了。（希望不會碰上吧）", 0, 0);
Talk("哈哈哈  走 今天不醉不歸", 36, 1);
DarkScene();
ModifyEvent(56, 3, 0, 3, -1, 0, 0, -1, -1, -1, -2, -2, -2);
ModifyEvent(61, 33, 0, 0, 0, 0, 745, 0, 0, 0, -2, -2, -2);
ModifyEvent(56, 23, 0, 23, -2, -2, -2, -1, -1, -1, -2, -2, -2);
ModifyEvent(56, 24, 0, 24, -2, -2, -2, -1, -1, -1, -2, -2, -2);
LightScene();
Join(36);
exit();
end;
if TryBattle(69) then
exit();
end;