DarkScene();
ModifyEvent(-2, 3, 1, 0, 754, 0, 0, 7624, 7624, 7624, -2, -2, -2);
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
LightScene();
WalkFromTo(48, 36, 21, 37);
SetTowards(2);
Talk("令狐兄，好久不見了，一向可好？", 0, 1);
Talk("還好。上次下山犯了門規，被師父罰到此處面壁思過。只是好久不見小師妹了，有些想念....她好久沒來了", 35, 0);
Talk("別再想你的小師妹啦，恒山有個小尼姑正在想你呢要我帶你去見她。", 0, 5);
Talk("不成師父命我在這里思過，我怎能隨意離開。", 35, 0);
Talk("那我和你打一場，如果你功夫不如我。就對你師父說是被我強行帶走的。接招啦。", 0, 5);
if TryBattle(204) == false then
Dead();
exit();
end;
LightScene();
Talk("看來華山派的功夫也不過如此嗎。呵呵", 0, 5);
Talk("適才在下輸招，是輸在力不如你，心中不服待我休息片刻，咱們再比過。", 35, 0);
Talk("那好 你進洞去休息吧。", 0, 5);