if InTeam(35) == false then
Talk("掌門已率領弟子上嵩山了。", 195, 0);
exit();
end;
Talk("六猴，師父呢？", 35, 4);
Talk("師父說封不平等這幾個劍宗棄徒請到了五岳劍派的令旗，咱們上嵩山去見左盟主，和他評一評這個道理。", 195, 5);
Talk("武林中說到評理，可并非單是“評”一“評”就算了事，一言不合，往往繼之以動武。", 35, 4);
DarkScene();
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
LightScene();
Talk("師父武功雖高，未必是左盟主的對手，何況嵩山派左盟主的師弟共有十余人之多，武林中號稱‘嵩山十三太保”他們貿然上嵩山去生事，豈非太也鹵莽？", 35, 4);
Talk("那咱們就沿路找找他們吧，看能不能幫上什么忙。", 0, 1);
Talk("好，師父他們人多，走的慢咱們應該能追上他們。", 35, 4);
ModifyEvent(103, 0, 0, 0, 0, 0, 760, 0, 0, 0, -2, -2, -2);
ModifyEvent(103, 2, 0, 0, 0, 0, 760, 0, 0, 0, -2, -2, -2);
ModifyEvent(103, 1, 0, 0, 0, 0, 760, 0, 0, 0, -2, -2, -2);
Talk("場景開啟藥王廟（224，306）", 0, 3);
OpenSubMap(103);