Talk("趕緊出去吧也不知道外面怎么怎么樣了總覺得有點不安。現在學什么功夫也來不急了......對了！ 以天魔功加北冥神功的恢復能力。這樣的話就...呵呵呵看誰能擋得住。", 0, 5);
Play2Amination(-1, 7664, 7688, 12, 7690, 7746);
Play2Amination(13, 7748, 7804, 14, 7806, 7862);
ModifyEvent(151, 12, 1, 12, 0, 0, 0, 7746, 7746, 7746, -2, -2, -2);
ModifyEvent(151, 13, 0, 13, 0, 0, 0, 7804, 7804, 7804, -2, -2, -2);
ModifyEvent(151, 14, 1, 14, 0, 0, 0, 7862, 7862, 7862, -2, -2, -2);
ModifyEvent(134, 0, 0, 0, 0, 0, 769, 0, 0, 0, -2, -2, -2);
ModifyEvent(134, 1, 0, 1, 0, 0, 769, 0, 0, 0, -2, -2, -2);