if HaveItemBool(215) == false then
Talk("這位少俠到梅莊來不知有何見教？", 31, 0);
exit();
end;
Talk(" 啊！這是北宋范寬的真跡“溪山行旅圖”，你．．．你是從何處得來的？", 31, 0);
Talk("這個你不必管。我聽江湖上傳言，梅莊四位莊主好酒，好畫，好劍，人稱三絕。我二人來到梅莊，乃是要和四位莊主打一個賭。我賭梅莊之中，無人能在劍法上勝得過這位風兄弟。", 247, 5);
Talk("你這小子，到底有什麼企圖？", 31, 0);
Talk("“企圖”沒有，“行旅圖”倒是有一幅．", 247, 5);
Talk("小子，少貧嘴，看劍。", 31, 0);
if TryBattle(43) == false then
Dead();
exit();
end;
LightScene();
Talk("真是長江後浪推前浪，今日敗在你的手里，我也沒話可說。小子，你等著，待我去請我三哥。", 31, 0);
DarkScene();
ModifyEvent(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(-2, 8, 1, 0, 789, 0, 0, 6048, 6048, 6048, -2, -2, -2);
SetSubMapLayerData(-2, 1, 37, 42, 0);
LightScene();