if HaveItemBool(213) == false then
Talk("二哥，就是這個後輩小生來找麻煩，你一定要幫我們報仇。", 31, 5);
Talk("是呀，二哥，你一定要幫我把“率意帖”奪過來。", 32, 0);
Talk("好了，三弟，四弟，不要再多說了。少俠你先請回吧，我是不會和你動手的。", 33, 4);
exit();
end;
Talk("這．．．這是．．．．我在前人筆記之中見過這記載．．．．上面說劉仲甫是當時國手，卻在驪山麓給一個鄉下老媼殺得大敗，登時嘔血數升，那局棋譜便稱“嘔血譜”。原想只道是個傳聞，怎料世上竟然真有這局嘔血譜？少俠，可否借老夫抄錄副本。", 33, 0);
Talk("哈！哈！這“嘔血棋譜”是我費盡千辛萬苦才得來的，看一次五千萬兩黃金，看不看隨你。", 247, 5);
Talk("二哥你瞧，這小子就是這德性，完全沒把我們梅莊放在眼里，先前還說梅莊中沒人是他那位風兄弟的對手，囂張極了。", 31, 0);
Talk("少俠，別敬酒不吃吃罰酒，我黑白子想要的東西從來沒有得不到的，你還是乖乖地交出來吧。", 33, 4);
Talk("二哥，別跟他多說廢話，咱們三人聯手，量他們插翅也難飛。", 32, 0);
Talk("枉費梅莊在江湖上的聲名如此響亮，想不到盡是一群倚多欺少之輩，可笑可笑。", 246, 5);
Talk("三弟，四弟，咱們梅莊可別讓這個家伙瞧扁了，就讓我來會一會。", 33, 0);
if TryBattle(45) == false then
Dead();
exit();
end;
LightScene();
Talk("我就說嘛，你們這幾個老頭子根本就不夠看，我瞧啊，那什麼大莊主想必也沒什麼料。不過既然來了，就把他叫出來比劃比劃。", 247, 5);
Talk("臭小子！有種別跑！", 33, 0);
DarkScene();
ModifyEvent(-2, 9, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(-2, 11, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(-2, 16, 1, 0, 793, 0, 0, 6064, 6064, 6064, -2, -2, -2);
ModifyEvent(-2, 17, 1, 0, 793, 0, 0, 6052, 6052, 6052, -2, -2, -2);
ModifyEvent(-2, 18, 1, 0, 793, 0, 0, 6058, 6058, 6058, -2, -2, -2);
SetSubMapLayerData(-2, 1, 37, 34, 0);
LightScene();