if TryBattle(23) == false then
Dead();
exit();
end;
ModifyEvent(31, 40, 0, 40, -1, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(31, 41, 0, 41, -1, 0, 0, 0, 0, 0, -2, -2, -2);
ModifyEvent(31, 42, 0, 42, -1, 0, 0, 0, 0, 0, -2, -2, -2);
LightScene();
Talk("田兄 你什么時候開始做護花使者啦。", 0, 5);
DarkScene();
LightScene();
Talk("事情就是這樣，兄弟 你能不能去找令狐沖來。恒山派總是時不時遭到攻擊我離不開身。", 29, 0);
Talk("包在我身上啦（奇怪？怎么五岳中只有左冷禪和岳不群沒有上俠客島）", 0, 5);
SetTowards(3);
Talk("咦  那匹馬不是追風嗎？現在我學會了凌波微步，看你往哪里逃。（往蒙古草原方向去了）", 0, 0);
ModifyEvent(138, 13, 0, 13, 0, 0, 241, 0, 0, 0, -2, -2, -2);