Talk("少俠來我泰山派，不知有何事。", 23, 0);
Talk("天門道長左冷禪野心勃勃....", 0, 5);
DarkScene();
LightScene();
Talk("真有此事！！！！我馬上去質問玉璣子他們....", 23, 0);
Talk("喂 喂 喂 你別那么沖動啊，不如將計就計......", 0, 5);
DarkScene();
LightScene();
Talk("好就依少俠說的辦....", 23, 0);
if TryBattle(26) == false then
end;
ModifyEvent(29, 0, -2, 0, 824, 0, 0, -2, -2, -2, -2, -2, -2);
ModifyEvent(29, 1, 1, 1, 824, 0, 0, -2, -2, -2, -2, -2, -2);
LightScene();
Talk("今日不殺我，我五岳劍派同氣連枝，改日我們再上黑木崖向閣下及東方不敗討教。", 23, 0);
ModifyEvent(126, 20, 1, 20, 848, 0, 0, 6818, 6818, 6818, -2, -2, -2);
ModifyEvent(126, 22, 1, 22, 0, 0, 0, 7062, 7062, 7062, -2, -2, -2);